[
  {
    "document_number": 1,
    "text": "Transportation Research Interdisciplinary Perspectives 11 (2021) 100437  Available online 14 August 2021 2590-1982/©   2021   The   Author(s).   Published   by   Elsevier   Ltd.   This   is   an   open   access   article   under   the   CC   BY-NC-ND   license  (http://creativecommons.org/licenses/by-nc-nd/4.0/). Perception of autonomous vehicles   –   A Ghanaian perspective  Williams Ackaah   a , * , Van Laar David Leslie   b , Kwame Kwakwa Osei   c  a   CSIR   –   Building and Road Research Institute, U. P. O. Box 40, Kumasi, Ghana  b   Regional Transport Research and Education Centre Kumasi, Civil Engineering Department, KNUST, Kumasi, Ghana  c   Kumasi Technical University, Civil Engineering Department, Kumasi, Ghana  A R T I C L E   I N F O  Keywords:  Autonomous vehicles Perception Sustainable transport Safety Ghana  A B S T R A C T  This paper examines the general perceptions of the public on Autonomous Vehicles (AVs). A survey was con- ducted that sampled 417 respondents. The survey was carried out using the convenience sampling method and was administered partly online and partly through face-to-face interviews. Descriptive analysis using SPSS was carried out for the variables using the chi-square tests to assess statistical significance. Most (66.4%) respondents were familiar with AVs. Majority (55.4%) had a positive opinion on AVs and most (78.2%) were interested in experiencing AVs. However, respondents still preferred to have some control (i.e., level-3 automation and below) should they experience using AVs. Respondents also expressed concern about AV use, with safety as the most important consideration. Respondents would utilize the free time available in use of AVs to be productive and work. Participants were optimistic, believing AVs will be available in the next ten years. To ensure public acceptance of AVs, government can: set out policies that make Ghana an attractive market for car manufacturers; put in place the necessary infrastructure to accommodate AVs into the existing transportation system; educate the public on the usefulness of AVs; highlight the positive impact AVs would have on the transportation system; introduce policies that would allow for AVs to be set at reasonable prices and for individuals to have subsidies and tax benefits associated with AV use. Further research should be carried out to include a larger proportion of respondents from several other cities in Ghana.  Introduction  Cities, nowadays, are constantly faced with rapidly rising pop- ulations which have led to changing patterns of movements for shop- ping, leisure, and work. With the continuous growth of the economy and a rise in both the urban population and vehicle ownership, there has been an increase in traffic demand, leading to delays, an increase in travel time, pollution, and fuel consumption. Errampalli et al., (2015) showed that vehicles that operate in congestion consume more fuel than those operating in steady-state traffic conditions for the same average speed. Also, according to Errampalli et al., (2015), congestion leads to an increase in travel time and road user cost. These problems are more prominent in the growing economies of the developing world. Speaking of developing countries, according to Igli  ́ nski and Babiak (2017), they are the countries most affected by the rise in greenhouse gases (GHG) emissions due to their rapid growth in transport demand. Even though the effects of GHG emissions are more pronounced in developing countries, the continuous increase in GHG emissions affects all nations globally because the transport sector is one of the largest emitters of GHG. In the Emissions Gap Report of 2019 produced by the United Nations Environment Programme (UNEP), it was estimated that GHG emissions rose by 1.5% per year for the last ten years with 2018 recording the highest GHG emissions total yet. To put that into context, the Emissions Gap Report of 2019 estimates that GHG emissions would need to be 55% lower by 2030 than in 2018 alone to limit global warming by 1.5 – 2 degrees Celsius. In an ironic but unfortunate twist, it has taken the deadly COVID-19 pandemic in 2020 to slow down GHG emissions in the world. This was seen in the Global Energy Review 2020 published by the International Energy Agency (IEA) where due to the pandemic, global energy demand decreased by 3.8% in the first quarter of 2020 resulting in an estimated decrease of GHG emissions by 8% for the year. However, the pandemic is a rare occurrence and once its effects are no longer felt, GHG emissions will rise to previous levels. Also highlighted in the report is that there is no sign yet of when GHG will peak indicating a likelihood that GHG emissions will continue to rise. One other huge consequence of the increase in vehicle use and ownership due to rapid economic and population growth is traffic safety and the unfortunate rise in fatalities from road traffic crashes. Traffic  * Corresponding author.  E-mail address:   ackaahwillie@yahoo.com (W. Ackaah).  Contents lists available at ScienceDirect  Transportation Research Interdisciplinary Perspectives  journal homepage: www.sciencedirect.com/journal/transportation- research-interdisciplinary-perspectives  https://doi.org/10.1016/j.trip.2021.100437 Received 1 March 2021; Received in revised form 21 July 2021; Accepted 2 August 2021\nTransportation Research Interdisciplinary Perspectives 11 (2021) 100437  2 fatalities and injuries, not only affect the livelihoods of those affected but also damage the economy of countries with high rates of traffic crashes. The global status report on road safety 2018 published by the World Health Organisation (WHO) revealed that more than 90% of the world ’ s fatalities due to traffic crashes emanate from low- and middle- income nations. Also, the continent with the highest road traffic death rates is Africa (WHO, 2018). Ghana recorded 2,284 deaths due to traffic crashes in 2019 according to the Motor Traffic and Transport Depart- ment (MTTD)   –   the highest for the past decade (Graphic Online, 2020). Maddox (2012) states that over 90% of traffic collisions can be attrib- uted to human error. All the above side effects or consequences such as noise and air pollution, congestion, safety, fuel use, and transportation costs due to economic growth, population growth, increase in vehicle ownership, and traffic demand put a blemish on the transport sector. This has led many different nations and institutions such as the automobile industry and technology industry to try and find innovative ways of making the transport sector safer, less polluted, less congested, more fuel-efficient, and cheaper. The result is the creation and use of Autonomous Vehi- cles (AVs). Most developed nations have now been able to test autonomous vehicles on their roads. However, in developing countries and especially countries in Africa, no plans and/or policies have been formulated involving autonomous technology. The Mobility 2030: ICE in Africa report published by Klynveld Peat Marwick Goerdeler International Limited KPMG, 2020 shows a thriving and growing market for the auto industry. In their report, they stated that the African auto aftermarket was worth $10 billion in 2019 and that the demand for automobile parts is projected to be $15 billion by 2022. This shows that there is an increasing demand for vehicles in Africa and   governments   should   take   advantage   of   this   opportunity   to encourage automobile manufacturers to test their autonomous vehicles in their countries. The earlier African countries formulate plans and policies regarding autonomous vehicles, the better prepared they will be for the inevitable trickle-down of the technology from the developed nations. Therefore ,   the objective of this paper is to determine the perception Ghanaians have of autonomous vehicles. This information will help guide the government to be more proactive and better prepared in making decisions and policies in the best interest of citizens before the technology inevitably trickles down into the country.  Literature review  What are autonomous vehicles (AVs)?  Autonomous Vehicles (AVs) are vehicles that can operate without physical control or monitoring by a human operator (Department of Motor Vehicles, California (DMV), 2020). This is the ideal vision of autonomous vehicles. However, due to its relative infancy, the Depart- ment for Transport, United Kingdom (UK) in its report titled   “ The pathway to driverless cars ”   makes a point to stress that successfully achieving the ideal vision of autonomous vehicles requires more testing and time. Over the years, there has been a steady evolution of technology implanted and used in vehicles. These technologies have slowly bridged the gap from standard vehicles driven manually to autonomous vehicles. For Anderson et al., 2016, the technologies that have been innovated have made it easier and more comfortable for drivers by making some decisions on their own and reducing the element of driver errors with assists such as crash warning systems, adaptive cruise control (ACC), lane-keeping systems, and self-parking technology. There are varying levels to which these assist and support systems are incorporated into vehicles - known as levels of automation. Different organisations have slightly different interpretations of the levels of automation. There are three main interpretations of levels of automation widely used:  •   National Highway Traffic Safety Administration (NHTSA) levels of automation;  •   Society of Automotive Engineers (SAE) levels of automation; and  •   German Association of the Automotive Industry (VDA) levels of automation. In the case of the NHTSA levels of automation, it categorized auto- mation levels into five, starting from level-0 and ending at level-4 which is a fully self-driving vehicle. NHTSA was the first to try to identify and describe the varying automation levels, however, its descriptions of the automation levels were not specific and clear enough (Godsmark, 2017). This led to the formulation of the SAE levels of automation which was built on the principles already laid out in the NHTSA levels of automa- tion (Godsmark, 2017). The SAE levels of automation are categorized into six levels ranging from the least form of automation which is level-0 to the highest form of automation which is level-5 as shown in Table 1. The levels are cate- gorized based on the vehicles ’   abilities and intelligence to know its surroundings and position within it (Frisoni et al., 2016). The SAE and NHTSA levels of automation are almost the same from level-0 to level-3 but where the specificity and clarity of the SAE build on and differentiates itself from the NHTSA is in its separation of NHTSA ’ s level-4 (fully self-drivable level) into two levels, namely level-4 (highly automated) and level-5 (fully automated) (Frisoni et al., 2016; Gods- mark, 2017). This is observed clearly in Fig. 1. Similar to the SAE levels of automation, VDA also describes six levels ranging from level-0 to level-5 with level-4 and level-5 indicating highly automated and fully automated, respectively. The VDA automation levels describe the duties of the system and driver at each level as seen in Table 2.  Stakeholder and public opinion of AVs  To get an idea of stakeholder and public opinions on AVs, several researchers and studies have conducted surveys. Freemark et al. (2019) conducted a large survey on transport and planning government officials representing 120 cities in the United States for their thoughts on AVs. Freemark et al ’ s. (2019) revealed in a survey that most officials are positive about AVs with 58% saying that AVs will increase safety and 62.6% saying they expect AVs to increase the quality of life. Officials,  Table 1  SAE Automation Levels (SAE International as cited in   Frisoni et al., 2016 ) .  SAE Level Name   Description  0   No Automation   The human driver performs all aspects of the dynamic driving task, even when enhanced by warning or intervention systems. 1   Driver Assistance   A driver assistance system of either steering or acceleration/deceleration but not both is provided in some driving modes with the human driver performing all other aspects of the dynamic driving task. 2   Partial Automation Driver assistance system(s) of both steering and acceleration/deceleration is provided in some driving modes with the human driver performing all other aspects of the dynamic driving task. 3   Conditional Automation For some driving modes, the automated driving system performs all aspects of the dynamic driving task with the human driver expected to respond to a request to intervene. 4   High Automation   For some driving modes, the automated driving system performs all aspects of the dynamic driving task even if the human driver does not respond to a request to intervene. 5   Full Automation   For all driving modes, the automated driving system performs all aspects of the dynamic driving task full-time under all road and environmental conditions.  W. Ackaah et al.\nTransportation Research Interdisciplinary Perspectives 11 (2021) 100437  3 also, mostly expected AVs to reduce congestion (38.6%), emissions (51.3%), and costs (50.3%). However, the survey also revealed some reservations officials had that included increased vehicle miles travelled (42.1%), increased number of vehicles (32.3%), increased urban sprawl (36.6%), and reduced government revenues (23.6%) and employment (36.6%). In   terms   of   public   opinions,   surveys   conducted   have   produced varying results with some surveys indicating the public ’ s unwillingness to use or adopt AVs whilst other surveys indicate a willingness to use or adopt AVs. For example, in their survey of 500 drivers, Schoettle and Sivak (2015) discovered that most of them were not comfortable riding in a fully automated vehicle. Only 18% of the British public surveyed in 2014 felt that fully autonomous vehicles should be an issue that the automotive manufacturers concentrate on (Ipsos MORI, 2014). Generally, the major public opinions and/or perceptions can be grouped into four main domains: benefits, safety, technology and social costs. The perceptions concerning the aforementioned domains have been found in the literature to have some significant associations with factors including demographics, geographical location, economy and vulnerability.  Benefits  Apart from increased convenience levels, safety improvement on the roadways is one of the most important benefits expected by prospective users to be significantly associated with autonomous vehicles (Howard and Dai, 2014). It is anticipated that there will be reduction in road crash related fatalities due to predicted fewer number of crashes. AVs are expected to contribute to smooth flow of vehicular traffic and conse- quently improves the environment by reducing noise pollution and emissions levels. The intention to purchase an AV has been linked to their environmental benefits. Wu et al. (2019), for example, asserted that about 60% of the population would be willing to purchase an AV provided they are to be environmentally beneficial. Also, there are economic prospects of AVs as a result of the predicted savings in energy consumption associated with them (Bansal et al., 2016; Mezei and L  ́ azanyi, 2018). In spite of the numerous potential benefits reported by several studies, it is interesting to mention that other researchers have reported counter-expectations. A research by the Taiebat et al. (2019) suggests that the perceived benefits from AVs could induce vehicular owners, especially in higher income groups, to travel extra miles, which to some extent could offset the potential energy-saving benefits that are expected from automation. The authors further forecast a 2 – 47% in- crease in travel demand for an average household as connected and autonomous vehicle usage increases. These do not only increase energy use but also traffic congestion and emissions.  Safety  Globally, there is a growing concern about the current rise in fatal- ities from road crashes (WHO, 2018). As such, the advent of AVs is seen by many researchers to be a major step towards achieving significant safety improvement on roadways. The findings from studies such as Hulse et al. (2018) revealed that autonomous vehicles were perceived as a   “ somewhat low risk ”   form of transport. However, the risky behaviours of both vulnerable road users (i.e., pedestrians, bicyclists and motor- cyclists) and drivers have been found by researches to be a major contributing factor of road crashes (King et al., 2009). The question therefore is that, given the risky behaviours of pedestrian and motor- cyclists, would pedestrian and cyclist crashes on roadways be reduced, even if autonomous vehicles were to behave more safely around pe- destrians and   other human operated   modes? Compared   to human operated vehicles, the risks involving AVs are perceived differently depending on the type of road user. In a study by Hulse et al. (2018), it was reported to be more risky to be a passenger in an AV than in a human-operated vehicle. The authors further found that pedestrians, in an area of AVs, were perceived to be at a lower risk than those in human operated vehicles. Jardim et al. (2013) reported that 59.5% of re- spondents of their study in the US indicated that safety of AVs had a positive influence on their purchase intentions of the new automobile technology and 82% of respondents puts safety ahead of cost as the most influential driver for adopting AVs. It is worth mentioning that an in- dividual ’ s level of awareness of AVs is associated with their perceived safety of AVs (Pyrialakou et al., 2020).  Fig. 1.   Comparison of SAE and NHTSA automation levels   (EPoSS, 2015 as cited in Frisoni et al., 2016).  Table 2  VDA levels of Automation (VDA-magazine, 2015).  VDA Level Name   Description  0   Driver Only   Human driver performs the longitudinal and lateral dynamic driving task with no system active. 1   Assisted   Human driver performs either the longitudinal or lateral dynamic driving task with the system performing the other dynamic driving task. 2   Partial Automation Human driver must monitor the system at all times whilst the system performs longitudinal and lateral dynamic tasks in a defined use case/driving mode. 3   Conditional Automation Human driver does not need to monitor the system at all times whilst the system performs longitudinal and lateral dynamic tasks in a defined use case/ driving mode. However, the human driver must be able to resume performing the dynamic driving task when requested by the system. 4   High Automation   Human driver is not required to perform any dynamic driving task during a defined use case/ driving mode whilst the system performs longitudinal and lateral dynamic driving tasks in all situations in a defined use case/driving mode. 5   Full Automation   Human driver is not required during a full journey whilst the system performs all dynamic driving tasks in all road and environmental conditions.  W. Ackaah et al.\nTransportation Research Interdisciplinary Perspectives 11 (2021) 100437  4 Social cost  In spite of the expected benefits associated with autonomous vehi- cles, there are several concerns over their social costs. According to Taiebat et al. (2019), the benefits of autonomous vehicles such as low energy consumption, and increase travel speed could induce travel among users. This increase vehicle kilometre travelled and consequently increase congestion, air pollution, and urban sprawl (Bahamonde-Birke et al., 2018). Moreover, social equity is predicted to reduce with limited accessibility options resulting from a decline of public mass trans- portation (Bahamonde-Birke et al., 2018; Krueger et al., 2016). Another concern about social equity is related to affordability. Comparatively, high income earners are expected to enjoy the new generation of vehi- cles more than low income earners. Fagnant and Kockelman (2015) raises the concern of the uncertainty over who is liable if an accident were to occur.  Technology  Autonomous vehicles are new technological advancement in the automobile industry. The main factors that influence prospective con- sumers ’   intention for adopting newly-emerging and high technology based products include but not limited to trust, familiarity with tech- nology, perceived ease of use and usefulness of the technology. Studies into automation have posited that trust is a major contributing factor of the adoption of any such automation (Kim et al., 2019; Lee and See, 2004; H  ̈ auslschmid et al., 2017). Autonomous vehicles are equipped with the technology which takes away the active personal-driving role of drivers and entrusts maximum control to the vehicles. Consequently, there may be reduced levels of trust since such automation turns drivers into passive supervisors (Pettersson and Karlsson, 2015; Sun et al., 2020). According to Gkartzonikas and Gkritza (2019), individuals are more willing to travel with newly-emerging modes when they are more familiar with the technology. Further, an individual ’ s attitudes and opinion about an emerging technology will be more favourable when evaluated to be more positive. Moreover, the more consumers find it easy to use an emerging technology, the more they are likely to adopt the technology because their perceived sense of efficacy and control are enhanced (Davis et al., 1989; Nastjuk et al., 2020).  Demographics trends in public opinions with AVs  There are significant trends and variations by socio-demographics in the perceptions and/or opinions of the public concerning AVs. From the body of literature, the socio-demographic characteristics of people including age, gender, nationality/geographic location and vulnera- bility   determine   how   they   accept   new   automobile   technologies (Abraham et al., 2017; Bansal et al., 2016). It is important to mention that diverse opinions of AVs have been identified in the literature.  Gender  The gender of the individual plays a key role in determining AV acceptance. In a study by Schoettle and Sivak, 2014, women were found to be less likely to show interest in AVs than men. Compared to females, males are more likely to perceive autonomous vehicles as less risky and therefore have a positive attitudes towards them (Hulse, et al. 2018). But some studies (e.g., Haboucha et al., 2017) have reported significant differences in the effect of gender on AV opinions when compared among respondents from different countries.  Age  Similar to gender, the impact of age on perceptions about AVs have been found to vary in diverse ways. According to Payre et al. (2014), older people are more likely to accept AVs but less likely to pay for this technology. On the other hand, Hulse, et al. (2018) posits that older people, relative to younger ones, are more likely not to ride in an autonomous vehicle. The elderly are less enthusiastic about the prospect of using AVs than their younger counterparts (Kyriakidis et al., 2015; Ipsos MORI, 2014; Bansal et al., 2016; Portouli et al., 2017). Risk levels by autonomous passengers have also been reported by Hulse et al. (2018) to be not significantly associated with age. Contrary to the findings of Hulse et al. (2018), Moody et al (2020) reported that young males have higher positive perceptions about the safety of AVs. Young males are more likely to undertake risky driving behavior, hence their positivity towards AV safety.  Nationality/geographical location  Hilgarter and Granig (2020) mentions that the opinions of in- dividuals about transport mobility depend on whether they are urban or rural dwellers. Public acceptance of AVs and its influencing socio- demographics   have   been   found   to   vary   by   nationality   and/or geographical location. This could be attributed to cultural differences. KPMG   (2013),   for   example,   reported   significant   variations   in   the acceptance of AVs when they conducted a number of focus-group meetings with people from Chicago, Los Angeles, and Iselin. Also, Moody et al. (2020) explored the differences in perception in AV safety across   multiple   countries.   The   authors   reported   that   urban,   fully employed   individuals   with   higher   incomes   and   education   levels perceive fewer years until AVs are safe to use. Also, individuals from developing countries that face greater road safety challenges predict fewer years until AVs will be safe enough for them to use. On the other hand, individuals in developed countries with greater motorization rates and lower road fatality rates are more pessimistic about the present and future safety of AVs (Moody et al., 2020). While gender was reported by Haboucha et al. (2017) to have significant impact in determining in- terest in AVs in Israel, the authors found no significant gender difference in the North America .   Contrary to the findings in India, North American men, compared to the women, were reported to have higher willingness to ride in AVs (Anania et al., 2018).  Vulnerable road users  One area that is gradually gaining the attention of researchers is the navigation and mobility issues of persons with disabilities in the era of AVs. According to CAAT (2019), the AVs are expected to be more noiseless   than   the   traditional   gas-powered   vehicles.   This   noiseless feature of AVs poses as a major safety challenge to the visually impaired pedestrian who rely on the sound they hear on the roads to safely interact with the approaching vehicle and navigate to their destination. Azizi Soldouz et al. (2020) conducted a study with visually impaired people from Canada and abroad. The authors found that majority of the visually impaired people prefer to get feedback and alerts from con- nected and autonomous vehicles (CAVs). Comparatively, blind people who rely on conventional navigation tools such as white cane and guide dogs are less likely to trust CAVs than those who rely on mobile appli- cations and technology-based devices for navigation purposes (Azizi Soldouz et al., 2020). Moreover, the positive attitudes of people with disabilities towards AVs may be influenced by their mobility issues with current public transit services and neighbourhood built environments (Hwang et al., 2020). However, a direct experience interacting with AVs will make individuals develop positive attitudes towards AVs. As re- ported by Penmetsa et al. (2019), significantly higher expectations of the safety benefits of AVs are associated with vulnerable road users who have the experience of interacting directly with AVs than those with no AV interaction experience. Similarly, Das et al., 2020 mentions that  “ participants with real AV interactions have higher expectations and interest in AVs than the participants with no experience. ”  Methods  Sampling and data collection  The survey for the study was conducted from July to August 2020 among the Ghanaian general public. No persons were excluded from the study except those who were under 18 years of age. Therefore, the  W. Ackaah et al.\nTransportation Research Interdisciplinary Perspectives 11 (2021) 100437  5 survey included both drivers and non-drivers as AV use is not subject to just the drivers ’   viewpoint. To gather data from as many people across the entire country, part of the survey was administered online through Google Forms and shared on various social media platforms such as Twitter, Facebook, and WhatsApp and also via contact and email lists. The rest were administered in person in Kumasi through face-to-face interviews at various locations such as taxi and bus (trotro) stations, offices, shops, restaurants, and the Kwame Nkrumah University of Sci- ence and Technology, Kumasi (KNUST) campus. The sampling method used in conducting the survey was the convenience sampling method. The convenience sampling method was adopted since it is simple, easy to use, aids in hypothesis generation, fast and cheap (Dudovskiy, 2016). As mentioned above, part of the survey was administered online. Three hundred (3 0 0) respondents completed and submitted the online form. One hundred and fifty (1 5 0) questionnaires were distributed in person in Kumasi. Of the 150 questionnaires distributed in person, 140 ques- tionnaires were returned generating a response rate of 93.3%. In addi- tion to the 10 questionnaires that were not returned, a further 23 questionnaires were discarded because they were incomplete leaving 117 complete questionnaires from the distribution to analyse. Therefore, there were a total of 417 responses analysed in the study after combining the online and the face-to-face surveys. Before answering the question- naire, respondents were provided with a background on AVs and the different levels of automation that exist to encourage respondents to form their own opinions on AVs. The survey took approximately 20 minutes to complete.  Measures  To determine the perceptions of the Ghanaian public on AVs, data on the public needed to first be collected as stated above before any anal- ysis. Therefore, a questionnaire was formulated that focused on gath- ering   data   based   on   the   demographics   (age,   gender,   income   and education level) of respondents and their general opinions on AVs. Also, all questionnaire answer options were represented with discrete vari- ables in the Statistical Package for Social Sciences (SPSS). Questions that were asked included:  •   What is your gender?  •   What age range do you belong to?  •   What is your highest level of education?  •   What is your monthly income?  •   Do you own a vehicle?  •   What is your driving experience?  •   Have you heard of AVs before?  •   What is your opinion on AVs?  •   Would you be interested in using AV should they be available?  •   Which level of automation would you prefer using?  •   Would you have concerns about using AVs?  •   Which of the following factors would you consider to be the most important before using AVs?  •   What would you do with the free time available from not driving if you were to use AVs?  •   When do you think AVs will be available and roaming around on roads in Ghana? A descriptive statistic and inferential statistics in the form of chi- square test of independence were adopted to analyse the responses in SPSS. Descriptive statistic is mainly a quantitative method and to a lesser degree a qualitative method that summarizes the data gathered from a study and presents the data in a way that can easily be interpreted and understood by everyone (Trochim, 2020; Woodrow, 2014). Data for descriptive statistics is mainly gathered through surveys but others such as case studies and correlational methods may be used (Baha, 2016). The use of descriptive statistics makes it easier for data to be understood and provides clarity. But, using descriptive statistics alone only summarizes the data obtained and doesn ’ t provide more detail such as the under- lying factors that affect the data and the different influences on the variables (Baha, 2016). Chi-square test of independence was employed to determine whether there is an association between the socio-demographic characteristics of the respondents and their opinions about AVs. For the purpose of this study, test with p value   <   0.05 were considered to have significant as- sociations at 95% confidence level.  Results  Demographics  The results show that respondents to the survey were almost evenly split between men and women   –   49.9% for men and 50.1% for women. A majority (62.6%) of respondents were between the ages of 18 to 29 years. Those over 60 years represented only 2.9% of respondents. The sample appears to be biased towards the younger population. However, this trend is in line with that of the Ghanaian population which is re- ported by the Ghana Statistical Service to have a younger population (Ghana Statistical Service, 2013). A majority (92.6%) having achieved a high school education or higher. More than half (58.0%) of respondents earn a monthly income of less than GH ₵   1000 (where US$1.00   ≈   GHS 5.50 at the time of data collection). The highest-earning respondents (greater than GH ₵   5000) made up 7.2% of the total. Over two-thirds (69.3%) of respondents do not own a vehicle, however, a majority of them (63.1%) have driving experience. Respondents were mostly from the two major cities of Accra (34.3%) and Kumasi (50.6%). All the de- tails on the demographics of the study have been presented in Table 3.  Familiarity with and general opinions on AVs  A little over two-thirds of respondents indicated that they had already heard of AVs before the survey as seen in Table 4. There was a marked difference ( χ 2 (1)   =   16.917; p   <   0.050) between males (75.96%) and females (56.94%) on their familiarity with AVs in the survey. The relationship between age and those who have heard of AVs before was also significant ( χ 2 (5)   =   19.768; p   <   0.050). Those with prior knowledge of AVs tended to be younger with 72.29% of those aged 18 – 24 and 75.27% of those aged 25 – 29 being aware of AVs. Education level and familiarity with AVs also had a significant relationship ( χ 2 (3)  =   36.889 and p   <   0.050) with postgraduates (79.37%) and those with a bachelor ’ s degree (72.03%) having heard of AVs before whilst only 29.03% of respondents with only basic education knew of AVs before- hand. There was a significant relationship between monthly income and those who have heard of AVs ( χ 2 (6)   =   22.085 and p   <   0.050). Re- spondents earning less than GH ₵   500 were less likely (67.24%) to have heard of AVs before than those who earned greater than GH ₵   5000 (73.33%). Owning a vehicle does not indicate that a person has heard of AVs before as their relationship was not significant ( χ 2 (1)   =   3.214 and p  =   0.073). There was a significant link between driving experience and familiarity with AVs ( χ 2 (4)   =   23.633 and p   <   0.050). A majority (55.4%) of respondents hold either a positive or some- what positive opinion on AVs. On the other hand, only 13.0% of re- spondents hold a negative view (i.e., respondents have a low opinion of AVs; are less willing to use and/or accept AVs; and generally, believe that the perceived disadvantages of AVs outweigh the benefits) of AVs (Table 5). Majority of males (59.14%) and females (51.67%) either have a positive or somewhat positive opinion (i.e., respondents have a high opinion of AVs; are more willing to use and/or accept AVs; and have belief in the perceived benefits AVs may provide) on AVs. However, the number of respondents who had an opinion on AVs did not differ by gender ( χ 2 (4)   =   7.989 and p   =   0.092). Age, on the other hand, had a significant association with the opinion of respondents on AVs ( χ 2 (20)  =   106.150 and p   <   0.050). A higher proportion (16.67%) of those aged  W. Ackaah et al.\nTransportation Research Interdisciplinary Perspectives 11 (2021) 100437  6 above 60 expressed negative opinions on AVs compared to the 25 to 29 year-olds (2.15%) and the 18 to 24 year-olds (4.82%). A significant link was found between the education level of respondents and their opin- ions on AVs ( χ 2 (12)   =   51.004 and p   <   0.050) as respondents with the lowest level of education in the survey were more negatively opinioned on AVs (45.16%) than their higher-educated colleagues. The relation- ship between monthly income and respondents ’   opinion on AVs was significant ( χ 2 (24)   =   57.751 and p   <   0.050). All earners had mostly positive opinions on AVs with only 21.43% and 14.29% of those earning between GH ₵   500-1000 and GH ₵   4000-5000 respectively having a negative opinion. Vehicle owners held a more positive opinion on AVs (60.93%) than non-owners (52.94%) but the difference between vehicle owners and non-owners was not significant ( χ 2 (4)   =   6.257 and p   =  0.181). Driving experience was significantly related to the respondents ’  opinion on AVs ( χ 2 (16)   =   67.200 and p   <   0.050). Those with no driving experience   were   more   positive   on   AVs   (54.55%)   than   negative (10.40%). Only respondents with 5 to 10 years of driving experience had any significant negative opinion on AVs (37.29%).  Interest in using AVs  A large portion of respondents (78.20%) said that they would be interested in using AVs as seen in Table 6. Gender was not significantly associated with interest in using AVs ( χ 2 (1)   =   0.009 and p   =   0.926). Also, the study found that males (78.37%) and females (77.99%) were practically identical in their in- terest in using AVs. The younger age groups are more interested in using AVs than the older age groups as the relationship between age and in- terest in using AVs was found to be significant ( χ 2 (5)   =   38.313 and p   <  0.050). This is highlighted by the fact that only 11.45% of 18 to 24-year- olds and 16.13% of 25 to 29-year-olds show no interest in AV use. On the other hand, 30.36%, 46.43%, and 35.29% of 30 to 39-year-olds, 40 to 49-year-olds, and 50 to 59-year-olds, respectively show no interest in AV usage. The only mild surprise is that just 16.67% of over 60-year-olds showed no interest. Education level and respondents ’   interest in using AVs had a significant relationship ( χ 2 (3)   =   17.877 and p   <   0.050). Respondents with only basic education showed a high (48.39%) non- interest in AVs.  Levels of automation  The level of automation respondents preferred the most was level-3 with 29.00%. About 17.00% of respondents prefer the full automation of level-5. There are also 13.90% of respondents who want to still be fully in control with no form of assistance whatsoever and prefer level- 0 (Table 7). Results showed that the number of respondents who preferred a certain level of automation did differ by gender ( χ 2 (5)   =   12.867 and p   <  0.050). Both genders, male (31.73%) and female (26.32%) prefer level-3 automation. Also, whereas men are more likely to use level-5 automa- tion (21.15%) than women (12.92%), women are more likely to use level-0 (17.70%) than men (10.10%). Most age groups prefer level-3 automation. Age was found not to have a significant relationship with the level of automation preference of respondents ( χ 2 (25)   =   35.810 and p   =   0.075). Unlike age, education level has a significant link with re- spondents ’   preferred level of automation ( χ 2 (15)   =   34.036 and p   <  0.050). The respondents with the highest level of education, that is,  Table 3  Demographics of the study.  Demographic Group   Frequency   Percent (%)  Gender of Respondents  Male   208   49.9 Female   209   50.1 Total   417   100.0  Age of Respondents  18 – 24   166   39.8 25 – 29   93   22.3 30 – 39   56   13.4 40 – 49   56   13.4 50 – 59   34   8.2 60 +   12   2.9 Total   417   100.0  Education Level of Respondents  Basic Education (Primary/JHS)   31   7.4 Senior High School   62   14.9 Bachelor degree   261   62.6 Post Graduate   63   15.1 Total   417   100.0  Monthly Income of Respondents  Below GH ₵   500   116   27.8 GH ₵   500 – 1000   126   30.2 GH ₵   1000 – 2000   74   17.7 GH ₵   2000 – 3000   41   9.8 GH ₵   3000   –   4000   16   3.8 GH ₵   4000   –   5000   14   3.4 Greater than GH ₵   5000   30   7.2 Total   417   100.0  Location of Respondents  Kumasi   211   50.6 Accra   143   34.3 Tema   18   4.3 Cape Coast   7   1.7 Sunyani   6   1.4 Tamale   4   1.0 Other   28   6.7 Total   417   100.0  Vehicle Ownership of Respondents  Yes   128   30.7 No   289   69.3 Total   417   100.0  Driving Experience of Respondents  None   154   36.9 Less than a year   77   18.5 1 to 5 years   83   19.9 5 to 10 years   59   14.1 Greater than 10 years   44   10.6 Total   417   100.0  Table 4  Respondents who have heard of AVs before.  Question -Have you heard of AVs before? Response   Frequency   Percent (%) Yes   277   66.40 No   140   33.60 Total   417   100.00  Table 5  Respondents ’   opinion on AVs.  Question -What is your opinion on AVs? Response   Frequency   Percent (%) Positive   114   27.3 Somewhat positive   117   28.1 Neutral   132   31.7 Somewhat negative   22   5.3 Negative   32   7.7 Total   417   100.0  Table 6  Interest of respondents in using AVs.  Question -Would you be interested in using AV should they be available? Response   Frequency   Percent (%) Yes   326   78.20 No   91   21.80 Total   417   100.00  W. Ackaah et al.\nTransportation Research Interdisciplinary Perspectives 11 (2021) 100437  7 postgraduates and bachelor degrees, prefer level-3 with 42.86% and 27.97%, respectively. The highest income earners (greater than GH ₵  5000) are more likely to use level-3 automation (46.67%) but this is not as   notable   because   monthly   income   and   the   level   of   automation preferred by respondents did not have a significant relationship ( χ 2 (30)  =   29.473 and p   =   0.493). Both vehicle owners (29.69%) and non- owners (28.72%) prefer level-3 automation. However, vehicle owner- ship did not have a significant association with the preferred level of automation ( χ 2 (5)   =   4.462 and p   =   0.485). There was a significant relationship between driving experience and respondents ’   preferred level of automation ( χ 2 (20)   =   51.770 and p   <   0.050). A plurality of the highly experienced drivers (greater than 10 years) would prefer level-3 automation (38.64%) whilst 20.13% of respondents with zero driving experience are more likely than others to prefer level-0 automation. Also, 42.37% of respondents with driving experience between 5 and 10 years prefer level-2 automation.  Concern about AVs  Most of the respondents (73.9%) would have concerns (i.e., re- spondents have reservations on issues related to AV use such as its safety and security; and its cost) about using AVs as shown in Table 8. AV use concern by respondents was not based on the difference in gender ( χ 2 (1)   =   0.020 and p   =   0.888). The majority of men (73.56%) and women (74.16%) equally expressed concerns with using AVs. A majority (91.67%) of respondents over 60 years old would be concerned about using AVs. However, there was no significant difference in the ages of respondents regarding their concerns about AV use ( χ 2 (5)   =  4.299 and p   =   0.507). The relationship between education level and AV use concern was significant ( χ 2 (3)   =   7.854 and p   <   0.050) with 93.55% of respondents with only basic education being concerned about AV use. Half (50.00%) of those earning between GH ₵   4000-5000 say they would not be concerned about using AVs. However, monthly income did not have a significant relation with AV use concern ( χ 2 (6)   =   9.176 and p   =  0.164). There was no significant difference ( χ 2 (1)   =   0.139 and p   =  0.709) between owners (72.66%) and non-owners (74.39%) on sharing the same concern about using AVs. Driving experience and AV use concern were significantly related ( χ 2 (4)   =   9.498 and p   =   0.050). Re- spondents with driving experience between 5 and 10 years would be more concerned about using AVs (89.83%) than others with differing driving experiences.  Factors to consider before using AVs  The majority (73.90%) of respondents claim safety is the most important factor they would consider before using AVs. The next most important factors for respondents are reliability with 11.30% and cost with 8.60%. Just 2.60% of respondents would factor vehicle emissions into their decision to use AVs (Table 9). Women (77.03%) are more likely than men (70.67%) to consider the safety of AVs before using them. Men (11.06%) are more likely to worry about the cost of AVs than women (6.22%). These results based on gender, however, were not significant ( χ 2 (4)   =   5.021 and p   =   0.285). Age and the most important AV use factor considered by respondents were significantly linked ( χ 2 (20)   =   43.681 and p   <   0.050). The youn- gest, that is, 80.12% of 18 to 24-year-olds and 88.17% of 25 to 29-year- olds and the oldest respondents, that is, 75.00% of over 60-year-olds both   consider   safety   to   be   more   important   than   middle-aged   re- spondents. Also, the most important AV use factor considered by re- spondents differed significantly based on the respondents ’   education level ( χ 2 (12)   =   23.251 and p   <   0.050). Approximately 78.16% of bachelor degree holders and 76.19% of postgraduates consider safety as the most important factor compared to just 62.90% of those who stopped at the senior high school level and 54.84% of those with basic education. Moreover, monthly income was significantly associated with the most important AV use factor considered by respondents ( χ 2 (24)   =  47.423 and p   <   0.050). No respondents (0.00%) earning anything higher than GH ₵   2000 even considered cost. More non-vehicle owners (76.47%) than owners (67.97%) consider safety as the most important factor, however, the most important AV use factor considered by re- spondents did not differ by vehicle ownership ( χ 2 (4)   =   5.950 and p   =  0.203). The most important AV use factor considered by respondents did differ by driving experience ( χ 2 (16)   =   19.313 and p   <   0.050) as 22.73% of the most experienced drivers (greater than 10 years) consider reli- ability as the most important factor which is higher than any other group.  Use of free time in AVs  Respondents tended to lean more towards work (34.80%) than reading (28.50%) in free time AV use as shown in Table 10. Others would rather prefer not to do anything (12.50%) whilst 13.90% of re- spondents would play with their phones and chat with friends/family. There   was   a   significant   relationship   between   gender   and   re- spondents ’   use of free time in AVs ( χ 2 (5)   =   11.487 and p   <   0.050). Both men (35.58%) and women (33.97%) are equally likely to work when riding in an AV whilst women (13.40%) are more likely than men (4.33%) to watch movies/TV shows. Age was not significantly associ- ated with respondents ’   use of free time in AVs ( χ 2 (25)   =   31.015 and p   =  0.189). Respondents over 60 years old are the least likely to work (25.00%) and the most likely to do nothing (25.00%) when riding in an AV. Education level and respondents ’   use of free time in AVs had a significant relationship ( χ 2 (15)   =   41.635 and p   <   0.050). Only 19.35% of respondents with basic education prefer to spend their free time in an AV working whilst 38.71% of them prefer to do nothing. A majority (64.29%)   of   respondents   earning   GH ₵   4000-5000   and   about   half (46.67%) of respondents earning greater than GH ₵   5000 monthly would prefer working. However, monthly income did not have a significant relationship with respondents ’   use of free time in AVs ( χ 2 (30)   =   41.614  Table 7  Level of automation respondents prefer.  Question -Which level of automation would you prefer using? Response   Frequency   Percent (%) Level-0   58   13.9 Level-1   44   10.6 Level-2   83   19.9 Level-3   121   29.0 Level-4   40   9.6 Level-5   71   17.0 Total   417   100.0  Table 8  Respondents concern about AV use.  Question -Would you have concerns about using AVs? Response   Frequency   Percent (%) Yes   308   73.9 No   109   26.1 Total   417   100.0  Table 9  Most important AV use factor for respondents.  Question - Which of the following factors would you consider to be the most important before using AVs? Response   Frequency   Percent (%) Safety   308   73.90 Cost   36   8.60 Vehicle emissions   11   2.60 Comfort   15   3.60 Reliability   47   11.30 Total   417   100.00  W. Ackaah et al.\nTransportation Research Interdisciplinary Perspectives 11 (2021) 100437  8 and p   =   0.077). Respondents ’   use of free time in AVs did not differ by vehicle ownership ( χ 2 (5)   =   8.335 and p   =   0.139). Individuals with more than 10 years of driving experience are more likely to do nothing (18.18%) or chat with friends/family (27.27%) than any other group. Also, 49.15% of those with 5 to 10 years of driving experience prefer to work with the given free time in an AV. However, respondents ’   use of free time in AVs did not differ by driving experience ( χ 2 (20)   =   30.587 and p   =   0.061).  AVs availability in Ghana  A plurality of respondents (37.6%) think AVs will be available and in use in Ghana in the next 10 years whilst 31.2% of respondents think AVs will be available in the next 10 – 20 years. Also, 16.3% believe AVs will be available after 30 years (Table 11). The relationship between gender and when respondents think AVs will be available in Ghana was significant ( χ 2 (3)   =   8.018 and p   <   0.050). More Women (40.67%) than men (34.62%) believe AVs will be available in Ghana in the next ten years. A majority (66.67%) of respondents over 60 years old expecting AVs to be available in the country in the next ten years contrasted with only 36.75% of those belonging to age group 18 – 24. Also, the 25 to 29-year-olds are the most pessimistic group as the result shows 23.66% of them expect AVs to be available after 30 years. These results, however, were not significant ( χ 2 (15)   =   20.815 and p   =  0.143) implying that the timeframe for when respondents think AVs will be available in Ghana does not depend on or differ by the age of re- spondents. The timeframe for when respondents think AVs will be available in Ghana does depend on and differs by education level ( χ 2 (9)  =   22.418 and p   <   0.050). The majority (58.06%) of those with basic education expect AVs in the next 10 years whilst 19.35% of them expect AVs after 30 years. Also, 42.86% of postgraduates anticipate AVs being available and in use in Ghana in 10 to 20 years. Monthly income was found to have a significant association with when respondents think AVs will be available in Ghana ( χ 2 (18)   =   28.966 and p   <   0.050). Of re- spondents earning the highest monthly income, 46.67% expect AVs in 10 to 20 years. Non-vehicle owners (18.69%) are more likely to expect AVs to be available after 30 years than vehicle owners (10.94%), how- ever, there was no significant relationship between vehicle ownership and when respondents think AVs will be available in Ghana ( χ 2 (3)   =  4.185 and p   =   0.242). The timeframe for when respondents think AVs will be available in Ghana did differ by driving experience ( χ 2 (12)   =  29.853 and p   <   0.050). Drivers with more than 10 years of driving experience (56.82%) are more likely to expect AVs in the next 10 years than those with no driving experience (42.21%).  Discussion  The proportion of male and female respondents of the survey closely matches the 2010 Ghana population census which showed Ghana has a population structure that is 48.80% male and 51.20% female (Ghana Statistical Service, 2013). The age of respondents was mostly youthful, but a highly educated group. However, the monthly income of re- spondents leaned towards the lesser earners in society. The more experienced drivers were more likely to have heard of AVs than the less experienced drivers. The opinion of respondents on AVs is mostly positive but similar to the findings of other studies (e.g., Kyr- iakidis et al., 2015; Bansal et al., 2016; and Portouli et al., 2017), the elderly were more negative on AVs than their younger counterparts. This could be attributed to the fact that the elderly may not be as familiar with technology as the younger ones   –   a demotivating factor to travel with AVs (Gkartzonikas and Gkritza, 2019). Majority of all the re- spondents across gender, age, education level, monthly income, vehicle ownership, and driving experience have a strong appetite to use AVs should they be available in Ghana. Men and women are equally likely to be interested in using AVs which is consistent with Haboucha et al. (2017) who found in the US no significant gender differences in AV use. It however contradicts studies by Kyriakidis et al. (2015), Jardim et al. (2013), Schoettle and Sivak (2014), and Bansal et al. (2016) that suggest that women are less likely to be interested in using AVs than males. The younger respondents are more interested in using AVs and is confirmed by similar studies (Kyriakidis et al., 2015; Ipsos MORI, 2014; Bansal et al., 2016; Portouli et al., 2017). Respondents prefer level-3 automation which suggests that whilst they are open to using AVs, they still want a certain degree of control over their driving. Also, women are more cautious than men and prefer to be more in control of their driving. One curious result though is the fact that respondents over 60 years of age are simultaneously the most likely age group to prefer level-0 and level-5. These are two completely contrasting levels of automation and may be a consequence of some older   respondents   wanting   complete   control   whilst   others   would welcome the stress reduction of level-5 that comes with no longer driving. Most respondents expressed concern about AV use with men and women being equally concerned. Those with a lower education level are more likely than highly educated individuals to have concerns about using AVs. Relatively, individuals with lower education levels are mostly not adequately informed and therefore lack better understanding of the technology involved in AVs. This consequently builds lack of trust and negative attitudes towards AVs which could also hinder develop- ment   and   slow   down   deployment   when   the   technology   matures (BOSCH, 2021; World Economic Forum, 2021). Almost all income earners have the same high level of concern whilst vehicle owners and non-owners are equally concerned about AV use. Consistent with the findings of Jardim et al. (2013), respondents of this current study regard safety as the main factor before considering AV use. This result is not surprising for respondents from a developing country with greater road fatality rates. They must have major safety concerns for a newly-emerging automobile technology, especially when they have not had a direct experience with it. They might as well be interested in automobile technology that minimises human errors   –   a major contributing factor of crashes in Ghana and the world as a whole (Maddox, 2012). The more educated the respondents are, the more likely they are to view safety as the most important AV use factor. The environment was the factor least considered by respondents. This could be attributed to the lack of awareness of the extent of air pollution in the form of emissions contributed by the conventional vehicles and how much AVs can help reduce pollution. One would assume the lower- income earners to consider cost more highly than their higher-earning  Table 10  Respondents ’   use of free time in AVs.  Question - What would you do with the free time available from not driving if you were to use AVs? Response   Frequency   Percent (%) Work   145   34.80 Read   119   28.50 Chat with friends/family   58   13.90 Watch movies/TV shows   37   8.90 Play games   6   1.40 Nothing   52   12.50 Total   417   100.00  Table 11  Respondents ’   opinion on the timeframe of AV availability.  Question - When do you think AVs will be available and roaming around on roads in Ghana? Response   Frequency   Percent (%) In the next 10 years   157   37.6 In 10 – 20 years   130   31.2 In 20 – 30 years   62   14.9 After 30 years   68   16.3 Total   417   100.0  W. Ackaah et al.\nTransportation Research Interdisciplinary Perspectives 11 (2021) 100437  9 counterparts and that assumption proved to be true. Interestingly, the more experienced drivers are less concerned about safety than their lesser experienced colleagues. The reason could be their perception of having enough experience over the years to control their vehicles in a safe manner More respondents would prefer to spend their free time in AVs working. This falls in line with a study by Anderson et al. (2016) that stated spending more time in AVs actually increases the productivity of riders by allowing them to work in the AV and thus reducing office working hours. Most respondents are highly optimistic, believing that AVs would be available in Ghana in the next ten years.Women are more optimistic than men in that regard. The older respondents are more optimistic than the younger respondents about when AVs will arrive in Ghana.  Conclusions and recommendations  Conclusions  Autonomous vehicles are a relatively new mobility option currently penetrating the market in some developed countries. This innovation will have a big impact on the sustainability of our transport systems and will also positively affect the transport infrastructure and its environ- ment. It will also have an impact on travellers ’   mode choice in the future and as a consequence, it will alter the transportation system and the way we travel. However, for AVs to be in use and penetrate the market in Ghana, it must first be generally accepted by the public. It is therefore imperative and in our best interest to understand the publics ’   perception of AVs. The   findings   from   the   study   are   as   follows;   almost   two-thirds (66.40%) of the public was familiar with AVs. Majority (55.40%) of the public had a positive opinion on AVs and a high proportion (78.20%) of the public were interested in using AVs. Most (29.00%) preferred level-3 automation should they experience using AVs. Regardless of the positive view on AVs, the public still had major reservations with ma- jority (73.90%) expressing concern about AV use with safety as the most important consideration. A large proportion (63.30%) of the public would use the free time available in AVs productively and work or read. In terms of when the public expects AVs to be available in Ghana, most believe it will be in the next ten years. Most of the socio-demographic characteristics of the respondents were found to influence interest in AV usage, level of automation, concern about AVs, factors to consider before using AVs among others.  Recommendations  Based on the findings above, the following are recommended; firstly, since most respondents are highly optimistic that AVs would be avail- able in Ghana in the next ten years, the government must set out policies that make Ghana an attractive and friendly proposition for car manu- facturers to invest in and conduct tests of AVs on the roadways of Ghana. In a large market like Africa, Ghana can take the initiative and capitalize on the appetite for car manufacturers to penetrate the African market by allowing the conditions for its competition in the market. Such car manufactures should take into consideration the most preferred level of automation (i.e., level 3 for the case of this study) in order to meet the needs and expectation of prospective users. Of course, the government must put in place the necessary infrastructure to accommodate and smoothly incorporate AVs into the existing transportation system. The government must educate the public on the usefulness of AVs and their benefits including roadway safety enhancement, reliability and pro- ductivity increment as they spend their free time in AVs working. The government can encourage a positive attitude towards AVs through enthusiasm   and   positive   advocacy   campaigns   tailored   to   provide adequate understanding of the newly-emerging automobile technology among the public. Ghanaian culture is one that lays a great deal of importance on the opinions of family and friends. Therefore, the gov- ernment can increase awareness by conducting widespread education on the positive impacts of AVs and through advertisement in both online and offline media. With the government increasing awareness, word of mouth begins to spread around friends and family of the public inevi- tably leading to a greater appetite to use AVs. Policies that would allow for AVs to be set at reasonable prices and for individuals to have sub- sidies and tax benefits associated with AV use could be introduced to attract the public. The government can also encourage the older gen- eration to use AVs by enlightening them about the benefits an AV would provide to their lifestyle and alleviating their concerns about the risks of AVs. Since the sustainability of the environment was found not to be a major factor considered by respondents to use AVs, there is the need to sensitise the public to cultivate a character that seeks to promote envi- ronmental sustainability; the consequence of this will be the adoption of AVs when they are available.  Limitations and future research  This study can be improved upon as some limitations require further research which are as follows; most of the responses were from two cities- Accra and Kumasi. Additional research may be done to include a larger proportion of responses from several other cities in Ghana. Another limitation is that since part of the survey was online, any clarification on the survey that was needed by the respondent or misunderstanding about the survey that the respondent had could not be explained or corrected unlike in the face-to-face interviews. Again, the study leaned too much towards the 18 to 24 year-old age group. Future research can contemplate sample weighting methods to fix the age issue. Lastly, respondents have not had an AV experience before, therefore most of their responses were based on how they think they will feel if they experienced riding in an AV rather than what they have already experienced. Analysis was based mainly on the socio-demographic characteristics of respondents. Respondents ’   travel patterns and pur- poses, and neighbourhood characteristics are important factors that may influence their decisions. We therefore recommend future studies to consider these factors to gain more insight into the issue. Further, this study adopted mainly descriptive statistics and inferential statistics in the form of chi-square test to gain understanding of the perceptions of the Ghanaian public about AVs. Such approaches do not reveal the joint impact of socio-demographic characteristics on AVs interests and con- cerns. Chi-square test, for example, cannot provide any inferences about causation. Analysis methods such as structural equation modelling that explains the complex interactions of influencing factors are recom- mended for future studies.  Declaration of Competing Interest  The authors declare that they have no known competing financial interests or personal relationships that could have appeared to influence the work reported in this paper.  References  Abraham, H., Lee, C., Brady, S., Fitzgerald, C., Mehler, B., Reimer, B., Coughlin, J.F., 2017. Autonomous vehicles and alternatives to driving: trust, preferences, and effects of age. In Proceedings of the transportation research board 96th annual meeting (TRB ’ 17). Anania, E.C., Rice, S., Walters, N.W., Pierce, M., Winter, S.R., Milner, M.N., 2018. The effects of positive and negative information on consumers ’   willingness to ride in a driverless vehicle. Transp. Policy 72, 218 – 224. Anderson, James M., NidhiKalra, Karlyn D. Stanley, Paul Sorensen, Constantine Samaras, and Tobi A. Oluwatola. (2016). Autonomous Vehicle Technology: A Guide for Policymakers, Santa Monica, Calif.: RAND Corporation, RR-443-2-RC. Available at: https://www.rand.org/pubs/research_reports/RR443-2.html. Azizi Soldouz, S., Hasnine, M.S., Sukhai, M., Nurul Habib, K., 2020. Looking through the perceptions of blinds: potential impacts of connected autonomous vehicles on pedestrians with visual impairment. Transp. Res. Rec. 2674 (5), 183 – 195.  W. Ackaah et al.\nTransportation Research Interdisciplinary Perspectives 11 (2021) 100437  10 Baha, H., 2016. An Introduction of Descriptive Analysis, its advantages and disadvantages. Master of Public Policy and Good Governance Research Methods in Comparative Politics. Bahamonde-Birke, F.J., Kickh  ̈ ofer, B., Heinrichs, D., Kuhnimhof, T., 2018. A systemic view on autonomous vehicles: Policy aspects for a sustainable transportation planning. disP-The Plann. Rev. 54 (3), 12 – 25. Bansal, P., Kockelman, K.M., Singh, A., 2016. Assessing public opinions of and interest in new vehicle technologies: An Austin perspective. Transportat. Res. Part C: Emerg. Technol. 67, 1 – 14. BOSCH, 2021. Lack of understanding about automated driving is keeping Brits in the slow lane. Accessed 20/05/2021. https://www.bosch.co.uk/news-and-stories/sto ries/lack-of-understanding-about-automated-driving-is-keeping-brits-in-the-slow-la ne/. CAAT. Connected and Automated Vehicles. http://autocaat.org/Technologies/ Automated_and_Connected_Vehicles/. Accessed 20/05/2021. Das, S., Dutta, A., Fitzpatrick, K., 2020. Technological perception on autonomous vehicles: perspectives of the non-motorists. Technol. Anal. Strat. Manage. 32 (11), 1335 – 1352. Davis, F.D., Bagozzi, R.P., Warshaw, P.R., 1989. User acceptance of computer technology: a comparison of two theoretical models. Manag. Sci. 35 (8), 982 – 1003. https://doi.org/10.1287/mnsc.35.8.982. Department of Motor Vehicles, California.   “ Autonomous Vehicles ” . Retrieved from https://www.dmv.ca.gov/portal/vehicle-industry-services/autonomous-vehicles/ autonomous-vehicle-definitions/[Accessed 19th June 2020]. Dudovskiy, J., 2016. The Ultimate Guide to Writing a Dissertation in Business Studies. A Step-by-Step Assistance. Errampalli, Madhu, Senathipathi, Velmurugan, Thamban, Deepa, 2015. Effect of Congestion on Fuel Cost and Travel Time Cost on Multi-Lane Highways in India. Int. J. Traffic Transp. Eng. 5 (4), 458 – 472. https://doi.org/10.7708/2217- 544X10.7708/ijtte.2015.5(4).10. Fagnant, D.J., Kockelman, K., 2015. Preparing a nation for autonomous vehicles: opportunities, barriers and policy recommendations. Transport. Res. Part A: Policy Pract. 77, 167 – 181. Freemark, Y., Hudson, A., Zhao, J. (2019). Are cities prepared for autonomous vehicles? Planning for technological change by US local governments. J. Am. Plann. Assoc. Frisoni, R., Dall ’ Oglio, A., Nelson, C., Long, J., Vollath, C., Ranghetti, D.   & McMinimy, S. (2016) Self-Piloted Cars: the future of road transport? Steer Davies Gleave & European Parliament, Committee on Transport and Tourism. Available at: http://www.europarl.europa.eu/RegData/etudes/STUD/2016/573434/IPOL_STU (2016)57343 4_EN.pdf. Ghana Statistical Service. (2013). 2010 Population   &   Housing Census Report: Children, Adolescents   &   Young People in Ghana. Gkartzonikas, Christos, Gkritza, Konstantina, 2019. What have we learned? A review of stated preference and choice studies on autonomous vehicles. Transport. Res. Part C: Emerg. Technol. 98, 323 – 337. Global Energy Review. (2020). IEA, Paris https://www.iea.org/reports/global-energy- review-2020. Global status report on road safety. (2018). Geneva: World Health Organization; 2018. Licence: CC BYNC-SA 3.0 IGO. Godsmark, P. The Definitive Guide to the Levels of Automation in Driverless Cars. (2017). Available online: https://driverless.wonderhowto.com/news/definitive- guide-levels-automation-for-driverless-cars-0176009/. Graphic Online.   “ Road crashes: 2,284 fatalities recorded in 2019   –   MTTD ” . (January 17, 2020). Retrieved from https://www.graphic.com.gh/news/general-news/road- crashes-2-284-fatalities-recorded-in-2019-mttd.html. Haboucha, Chana J., Ishaq, Robert, Shiftan, Yoram, 2017. User preferences regarding autonomous vehicles. Transport. Res. Part C: Emerg. Technol. 78, 37 – 49. H  ̈ auslschmid, R., von Buelow, M., Pfleging, B., Butz, A., 2017. March). Supporting Trust in autonomous driving. In: In   Proceedings of the 22nd international conference on intelligent user interfaces , pp. 319 – 329. Hilgarter, Kathrin, Granig, Peter, 2020. Public perception of autonomous vehicles: a qualitative study based on interviews after riding an autonomous shuttle. Transport. Res. Part F: Traffic Psychol. Behav. 72, 226 – 243. Howard, D.,   &   Dai, D. (2014). Public perceptions of self-driving cars: The case of Berkeley, California. In Transportation research board 93rd annual meeting (Vol. 14, No. 4502, pp. 1-16). Hulse, Lynn M., Xie, Hui, Galea, Edwin R., 2018. Perceptions of autonomous vehicles: Relationships with road users, risk, gender and age. Saf. Sci. 102, 1 – 13. Hwang, J., Li, W., Stough, L.M., Lee, C., Turnbull, K., 2020. People with disabilities ’  perceptions of autonomous vehicles as a viable transportation option to improve mobility: An exploratory study using mixed methods. Int. J. Sustain. Transport. 1 – 19. Igli  ́ nski, H., Babiak, M., 2017. Analysis of the potential of autonomous vehicles in reducing the emissions of greenhouse gases in road transport. Procedia Eng. 192, 353 – 358. https://doi.org/10.1016/j.proeng.2017.06.061. Ipsos MORI. (2014) Only 18 per cent of Britons believe driverless cars to be an important development for the car industry to focus on. Ipsos MORI Loyalty Automotive Survey. Ipsos MORI. Available at: https://www.ipsos.com/ipsos-mori/en-uk/only- 18-cent-britons-believe-driverless-cars-be-important-development-car-industry- focus. Jardim, A. S., Quartulli, A. M.,   &   Casley, S. V. (2013). A Study of Public Acceptance of Autonomous Cars. Worcester Polytechnic Institute: Worcester, MA, USA. Kim, Moon-Koo, Park, Jong-Hyun, Oh, Jeesun, Lee, Won-Seop, Chung, Dongjae, 2019. Identifying and prioritizing the benefits and concerns of connected and autonomous vehicles: A comparison of individual and expert perceptions. Res. Transport. Busin. Manage. 32, 100438. https://doi.org/10.1016/j.rtbm.2020.100438. King, Mark J., Soole, David, Ghafourian, Ameneh, 2009. Illegal pedestrian crossing at signalised intersections: incidence and relative risk. Accid. Anal. Prev. 41 (3), 485 – 490. KPMG (2013). Self-Driving Cars: Are We Ready https://assets.kpmg/content/dam/k pmg/pdf/2013/10/self-driving-cars-are-weready.pdf. KPMG (2020). Mobility 2030 ICE in Africa. 3 – 5. Retrieved from https://assets.kpm g/content/dam/kpmg/za/pdf/pdf2020/mobility-2030-ice-in%20africa.pdf. Krueger, Rico, Rashidi, Taha H., Rose, John M., 2016. Preferences for shared autonomous vehicles. Transport. Res. Part C: Emerg. Technol. 69, 343 – 355. Kyriakidis, M., Happee, R., de Winter, J.C.F., 2015. Public opinion on automated driving: Results of an international questionnaire among 5000 respondents. Transport. Res. Part F: Traff. Psychol. Behav. 32, 127 – 140. Lee, J.D., See, K.A., 2004. Trust in automation: Designing for appropriate reliance. Hum. Factors 46 (1), 50 – 80. Maddox, John. (2012). Improving Driving Safety Through Automation, presentation at the Congressional Robotics Caucus, National Highway Traffic Safety Administration, July 25. Mezei, J  ́ anos Imre, L  ́ azanyi, Korn  ́ elia, 2018. Are we ready for smart transport? Analysis of attitude towards public transport in Budapest. Interdisciplinary Description of Complex Systems: INDECS 16 (3), 369 – 375. Moody, Joanna, Bailey, Nathaniel, Zhao, Jinhua, 2020. Public perceptions of autonomous vehicle safety: An international comparison. Saf. Sci. 121, 634 – 650. Nastjuk, Ilja, Herrenkind, Bernd, Marrone, Mauricio, Brendel, Alfred Benedikt, Kolbe, Lutz M., 2020. What drives the acceptance of autonomous driving? An investigation of acceptance factors from an end-user ’ s perspective. Technol. Forecast. Soc. Chang. 161, 120319. https://doi.org/10.1016/j. techfore.2020.120319. Payre, William, Cestac, Julien, Delhomme, Patricia, 2014. Intention to use a fully automated car: Attitudes and a priori acceptability. Transport. Res. Part F: Traffic Psychol. Behav. 27, 252 – 263. Penmetsa, Praveena, Adanu, Emmanuel Kofi, Wood, Dustin, Wang, Teng, Jones, Steven L., 2019. Perceptions and expectations of autonomous vehicles – A snapshot of vulnerable road user opinion. Technol. Forecast. Soc. Chang. 143, 9 – 13. Pettersson, I., Karlsson, I.C.M.A., 2015. Setting the stage for autonomous cars: a pilot study of future autonomous driving experiences. IET Intel. Transport Syst. 9 (7), 694 – 701. E. Portouli, G. Karaseitanidis, P. Lytrivis, A. Amditis, O. Raptis and C. Karaberi. (2017).  “ Public attitudes towards autonomous mini buses operating in real conditions in a Hellenic city, ”   2017 IEEE Intelligent Vehicles Symposium (IV), Los Angeles, CA, pp. 571-576, doi: 10.1109/IVS.2017.7995779. Pyrialakou, V.D., Gkartzonikas, C., Gatlin, J.D., Gkritza, K., 2020. Perceptions of safety on a shared road: Driving, cycling, or walking near an autonomous vehicle. J. Saf. Res. 72, 249 – 258. Schoettle, B.; Sivak, M. (2014). A Survey of Public Opinion about Autonomous and Self- Driving Vehicles in the US, the UK, and Australia. Available at: https://deepblue.lib. umich.edu/bitstream/handle/2027.42/108384/103024.pdf?sequence = 1 & is Allowed = y. Schoettle, B.   &   Sivak, M. (2015). Motorists ’   Preferences for Different Levels of Vehicle Automation. University of Michigan, Transportation Research Institute. Available at: https://deepblue.lib.umich.edu/bitstream/handle/2027.42/114386/103217.pdf? sequence = 1 & is Allowed = y. Sun, Xu, Li, Jingpeng, Tang, Pinyan, Zhou, Siyuan, Peng, Xiangjun, Li, Hao Nan, Wang, Qingfeng, 2020. Exploring personalised autonomous vehicles to influence user trust. Cogn. Comput. 12 (6), 1170 – 1186. Taiebat, Morteza, Stolper, Samuel, Xu, Ming, 2019. Forecasting the impact of connected and automated vehicles on energy use: a microeconomic study of induced travel and energy rebound. Appl. Energy 247, 297 – 308. Trochim, W.M.K. Research Methods Knowledge Base. (2020). Retrieved from: https:// conjointly.com/kb/descriptive-statistics/. United Nations Environment Programme. (2019). Emissions Gap Report 2019. UNEP, Nairobi. VDA-Magazine (2015),   “ From Driver Assistance Systems to Automated Driving ” . VDA magazine   –   Automation. Woodrow, L., 2014. Presenting Descriptive. Statistics. 5 (1), 49 – 60. World Economic Forum (2021). Look no hands: self-driving vehicles ’   public trust problem. https://www.weforum.org/agenda/2019/08/self-driving-vehicles-public- trust/ Accessed 20/05/2021. World Health Organization (2018). Global status report on road safety 2018: summary (No. WHO/NMH/NVI/18.20). World Health Organization. Wu, Jingwen, Liao, Hua, Wang, Jin-Wei, Chen, Tianqi, 2019. The role of environmental concern in the public acceptance of autonomous electric vehicles: A survey from China. Transport. Res. Part F: Traffic Psychol. Behav. 60, 37 – 46.  W. Ackaah et al."
  },
  {
    "document_number": 2,
    "text": "Adaptive State Space Control of a Camera Platform for an Autonomous Ground Vehicle Alois Unterholzner and Hans-Joachim Wiinsche  Abstract-A   novel multi-focal camera vision system for au- tonomous ground vehicles is presented. The camera platform is pivotable in pitch and yaw axis. to provide a wide fi.eld of   :i~w.  Camera configuration of yaw aXIs can be changed whIle retaInIng camera calibration for later reuse. But different configurations are likely to result in different system dynamics,   ~hich   i~~lies  the need for a motion controller capable of adaptIng to dIstInct configurations. This paper presents a brief description of the platform design. Furthermore the design of the adaptive platform control law is presented together with experimental results to demonstrate the validity of the approach. I.   INTRODUCTION Perception of the environment is an important prerequisite for autonomous ground vehicles to be able e.g. to distinguish drivable from impassable terrain, to avoid obstacles and to navigate within its environment. Visual data is one impor- tant source of information for the perceptional system. For autonomous ground vehicles visual sensors should be able to meet - possibly competing - requirements such as wide field of view, high resolution and stereo vision. A wide field of view is desirable to scan simultaneously as much of the vehicles environment as possible. A high resolution is required for early detection of distant objects. The maximum range of object detection limits the maximum speed of the vehicle. Stereo vision is used to gather 3D information of the environment. These requirements and the resulting design of multi focal camera platforms are discussed e.g. in [1] and [2]. According to [1], platforms pivotable in pitch and yaw axis and equipped with several cameras, that either provide a wide field of view or a high resolution, offer a good compromise to meet the needs of visual perception in autonomous ground vehicles. An overview on camera platforms, especially platforms for humanoid robots,   is   given   in   [3]   and   [4].   The design of motion controllers for camera platforms in autonomous ground vehicles is discussed in [5]. Although a camera platform offers a good compromise cov- ering more or less the needs of each visual perception module of the autonomous vehicle, the optimal camera configuration for a single perception module can differ from the currently utilized platform configuration. To detect e.g. lane markings black/white cameras might be best, to detect drivable areas in off-road terrain color cameras might be better. Divergent cameras offer a wide field of view. Parallel cameras, on the The authors gratefully acknowledge partial support of   thi~   wor~   b.y the Deutsche Forschungsgemeinschaft (German Research FoundatIon) wIthin the Transregional Collaborative Research Centre 28   Cognitive Automobiles.  All authors are with the Institute for Autonomous Systems Technology (TAS), University of the Bundeswehr Munich, 85577 Neubiberg, Germany. Contact author email: alois.unterholzner@unibw.de 978-1-4244-3504-3/09/$25.00 ©2009 IEEE (a) (b) Fig. 1.   Two possible camera platform configurations contrary, increase the range where stereo vision is possible. Depending on their range of interest different perception mod- ules require different focal lengths of camera lenses. Therefore the software designer prefers to use the camera configuration that suits best his application's demands. For this reason, in our research group the camera platform configuration of our experimental vehicle is frequently changed. With every change of the cameras the extrinsic camera parameters are lost and recalibration is required. Moreover exchanging   cameras   may   alter   platform   dynamics   due   to different camera masses, which in turn alters platform inertia leading to reduced performance of platform motion. To overcome these problems we developed a camera plat- form following not only the design recommendations given in [1], but offering additionally the possibility to exchange cameras   while retaining camera calibration for   later reuse of this configuration. Two possible platform configurations are shown in Figure   1. For easy exchange of the cameras they are mounted on adapter plates (Fig. 1(b)). These plates are attached to the platform yaw axis plate. For high repeat accuracy the plates are positioned with adjust pins relative to the yaw axis plate. Thus camera calibration is preserved as long as the cameras remain fixed to the adapter plates. Pitch axis drive and position sensor are mounted on top of the yaw axis plate. The pitch axis camera is placed in the hollow shaft of the yaw axis drive. A mirror is used to reflect the horizontal view towards the camera in the hollow shaft. Inertia of the pitch axis is kept low this way since only the mirror has to 591 Authorized licensed use limited to: Morgan State University. Downloaded on January 17,2025 at 15:25:01 UTC from IEEE Xplore. Restrictions apply.\nbe rotated. Thus the weight of the pitch axis drive can also be kept to a minimum, which in turn reduces inertia of the yaw axis. Placing the pitch axis camera in the centre of rotation of the yaw axis further reduces yaw axis inertia. But, as already mentioned, altering the camera configuration may lead to a change in platform dynamics, which is obvious from Figure l(a) and l(b). Therefore this paper presents an adaptive motion controller capable of adjusting to different camera configurations. The following parts of the paper are organized as   follows:   In section II the dynamic   model of platform yaw axis is derived. Section III presents the applied parameter estimator.   Since   we   use   state   space   control,   in section   IV   the   applied   state   estimator   is   introduced.   The control law is derived in section V. Stability considerations are presented in section VI. Experimental results are discussed in section VII. Finally the paper concludes in section VIII. II.   DYNAMIC MODEL Plant dynamcis can be modelled as a nonlinear second order differential equation:  1-   Td J '  with regression variables (9)  (11)  and time variable parameter vector  Ok-l   =   (al k_ 1 ,   a2k_l'   b2k _ 1 ,   8Ik _ 1 ,   82k _ 1   )T cPk-1   (-'Pk-l,   -'Pk-2,   Ik-2,   (10)  sgn (('Pk-l   -   'Pk-2)IT)   ,   COS('Pk_2))T  we derive a discrete time plant model  'Pk   -al   .   'Pk-l   -   a2   .   'Pk-2   +   b 2   .   I k- 2   (7)  ~   ('Pk-l   -   'Pk-2   )   ~   (   ) -VI·   sgn   T   -   V2   .   COS 'Pk-2  with parameters (8) which is linear in the parameters. Thus (7) can be written as linear regression  (1) (J p   +   Jc )   .   <p   =   k m   .   I   -   T<p   -   T<iJ  with   T c   representing Coulomb and   d   viscous friction coef- ficient, and   sgn(x)   being the signum function. The angular position dependent disturbance torque with   I   as torque generating motor current,   k m   motor torque constant,   Jp   inertia   of platform   yaw   axis   and   J c   inertia resulting from attached cameras including adapter plates. The angular velocity dependent disturbance torque   T   <iJ is described by (14) (12) (13)  (16)  as   suggested   in   [7]   to   keep   ?Ok-l   away   from   zero.   The underlying assumption of equation (13) is a random walk model suitable for a discrete time Recursive Least Squares (RLS) type parameter estimation scheme  POk - 2cPk-1  for parameter variation, where   Wk-l   is a white noise sequence having covariance matrix   QOk-l.   To avoid estimator windup with   P Ok -   1   growing unbounded due to estimation data being not persistently exciting for a long time period,   trace(Pok_ 1 )   is monitored and   QOk-l   is set to zero for   trace (POk-   1   )   exceeding a certain threshold. To track fast parameter changes Gump parameters) covariance resetting is used (from [7]). Setting  POk -   1   =   aI,   0   <   amin   ::;   a   ::;   a max   <   00   (15) in case of a sudden increase of estimation error  1 +   cP[-IPOk- 2cPk-1  R   ~   ~T   R R   Ok-2'f/k-I'f/k-1   Ok-2 Ok-2   -   ~T   R   ~  1 +   'f/k-l   Ok-2'f/k-1  A   A   (T   A   )  Ok   Ok-l   +   K Ok   'Pk   -   cPk-IOk-1  as described in [7].   ?Ok-l   in (12) tends to zero for   k   ---+   00 and therefore estimator gain   KO k   also tends towards zero. Parameter estimates are then not updated any longer:   The estimator is virtually switched off. In order to be able to track time varying parameters,   ?Ok-l   must be kept away from zero. To track slowly time varying (drifting) parameters we use covariance modification (3) (2) (6)  ('Pk+l   -   'Pk) IT ('Pk+2   -   2'Pk+1   +   'Pk) IT2  T<iJ   =   T   c   .   sgn(p)   +   d·   (p T<p   =   r·   m·   g. sin(Op)   .   cos('P)  J   .   <p   =   k m   .   I   -   d   .   (p   -   T c   .   sgn( (p)   -   Tu   .   cos('P)   (5)  III.   PARAMETER ESTIMATION Since model parameters   J,   d,   T c   and   Tu   are unknown a parameter estimator is used to get estimates   J,   d,   f   c   and  f   u   respectively. Thus discretizing equation (5) using forward differences as suggested in [6] results from unbalanced mass   m   of platform yaw axis, with distance   r   from center of gravity of unbalanced mass   m   to center of rotation of platform yaw axis,   9   gravitational accel- eration and   Op   adjustable pitch angle of platform yaw axis. Unbalanced mass results from pitch axis encoder outweighing pitch axis drive (Fig. l(b)) and from the mass of the cameras attached to one side of the platform outweighing camera mass of the opposite side (Fig. l(a)). Defining   r·m·g·sin(Op)   =:   Tu  disturbance torque   T <p   can be written as  T<p   =   T   u   .   cos('P)   (4)  With equations (2) and (4) plant dynamics (1) can be summa- rized to  592 Authorized licensed use limited to: Morgan State University. Downloaded on January 17,2025 at 15:25:01 UTC from IEEE Xplore. Restrictions apply.\nwith   0 e being the vector of constrained parameters defined as  Pmin(j)   ::;   p(j)   ::;   Pmax(j),   V j   (20) We use the parameter projection scheme described in   [7], which retains convergence properties of algorithm (12) to (15). The constrained parameters are derived as follows AI   A   T   -1   T   A  Ok   =   Ok   +   POk-   1   Sk(Sk POk-   1   Sk)   Sk (Oe   -   Ok)   (18)  (29)  Fx   +   Gu,   y   =   Cx,   with  (   .   .)T   -   I   +   I <p,   <p,   Td,   Td   ,U   =   fb   ref x J.'P   =   km·(Ifb+Iref)-d·(P   (26)  -(Te   -   T e )   .   sgn((p)   -   (Tu   -   T u )   .   cos(<p)  (28) as disturbance model, as this is found in [8] to be a good com- promise between model complexity and estimation accuracy in the context of friction compensation. Now we are able to derive an state estimator. Using contin- uous time state space formulation we derive from equation (27) and disturbance model (28) the state space description with   Iff   resulting from   feedforward   control,   I fb   resulting from feedback control and   Iref   resulting from reference input  r.   Inserting feedforward control (24) in the plant model (5) we get We use Summarizing the remaining disturbance torques resulting from parameter estimation errors   Tu   -   T u   and   Te   -   T e   as well as from unmodelled disturbances in one disturbance torque   Td,  equation (26) can be written as  J·'P=km·(Ifb+Iref)-d·(P-Td   (27)  (19) for   O(i)   >   Omax(i)  for   O( i)   <   Omin   (i)   ,Vi else indicating an abrupt parameter change, the parameter estimator is reinitialized with a large error covariance and therefore able to track fast parameter changes. To further enhance the robustness of parameter estimation and   to   be   able   to   include   prior knowledge   about the   pa- rameters, we use parameter projection to constrain parameter estimates to stay within  Omin   (i)   ::;   O( i)   ::;   Omax   (i),   V i   (17) Matrix   S   is used to select only those parameters for projection that are not satisfying equation (17).   S   is built by adding unit vectors ei to   S   if   O( i) is not within constraints. Since   O(i)   may   be   a   function   of more   then   one   plant parameter (cf. eq. 8), deriving   Oe( i)   from upper and lower bounds of estimated plant parameters is not straightforward. Therefore we calculate   0 e at every time instant   k.   If   p(j)   is not within the limits of (20) we change plant parameter bounds as follows (32)  o  krnT  -J-  o o  ,B=  o   0  -~   0 1   T  o   1  T  J-Td -J-  o o 1 o o o  0   1   0   0   0 0   d   1   0   k rn  -\"J   -\"J   ,G=   J  0   0   0   1   0 0   0   0   0   0  (1,   0,   0,   0)   (30)  A  C   =   (1,   0,   0,   0) as derived in [7], we are able to get estimates   <Pk, <Pk   and   Tdk'  which are used in the control law described in sec. V. C   =  F  Replacing parameters   J   and   d   at every time step   k   with their estimates   J k   and   dk,   we get   Ak   and   Bk   as state and input matrices respectively. Inserting these matrices in the Kalman filter equations As   we   are   using   a   discrete   time   Kalman   filter   for   state estimation we need a discrete time description of (30):  Xk+l   =   AXk   +   BUk,   Yk   =   CXk   (31)  Using (6) for discretization we get (25) (21)  Pmaxk (j)   for   Pk(j)   >   Pmaxk (j) Pmink (j)   for   Pk (j)   <   Pmink (j)   (22)  Pmink (j) Pmaxk (j)  with vector of estimated plant parameters  P =   (J,d,Te,Tu)T  Otherwise they are left unchanged. Then we use equation (8) to calculate   O(   i)   for   all   2)   combinations of   Pmink (j)   and  Pmaxk(j)   setting the bounds of   0   to  Omaxk   (i) =   m~x   O( i,   j)   and   Omink   (i) =   m~n   O( i,   j)   (23) 2J   2J IV.   STATE ESTIMATION For applying a state space control law full state information is required. Since only the yaw axis position is measured, we need a state estimator to derive full state information. Since the plant model (5) is nonlinear, we use parameter estimates  T e   and   T u   to compensate for the nonlinear disturbance terms in equation (5) with disturbance feed forward  Iff   =   k;;/   .   (Te · sgn((p)   +   Tu   .   cos(<p))   (24)  In [6]   a similar approach is suggested for adaptive friction compensation. The plant input current   I   can be written as follows: 593 Authorized licensed use limited to: Morgan State University. Downloaded on January 17,2025 at 15:25:01 UTC from IEEE Xplore. Restrictions apply.\nSince   t a   is a function of   VJ   we have chosen To determine   Wo   we use the design relations for dominant second order closed loop poles given in [12]. (38) (41) (40) (42)  r   = WI   'Pre!   +   W2<Pre!  with gains WI and   W2.   Using discretization (6) and applying z-Transform we derive the discrete time reference signal  z-l r(z)   = (WI   +   ---;y-W2)'Pre!  as adjustment rule for   ts,   where ,\\ is an empirically derived constant, that offers a good compromise between step response time and actuator saturation. The platform's task is either to track objects or to conduct fast saccades. Therefore the reference   r   is designed to track the desired yaw angle   'Pre!   up to a ramp signal without steady state error. Thus   r   is a linear combination of   'Pre!   and its time derivative   <Pre!  with settling time   t s   and damping (. Damping is chosen (   > 1  to avoid overshoot. Acceleration time   t a   for angular position  'P   depends on In our approach we separated state and parameter estimation in a RLS parameter estimator (cf. e.g. [7], [9]) and a Kalman filter for state estimation. An alternative would be the joint parameter and state estimation as provided for instance by Bootstrap Algorithms as suggested e.g. in [10], [7] and [11]. We however decided to separate parameter and state estimaton for three reasons: First of all there are less parameters to estimate in our approach compared to a Bootstrap Algorithm, since this algo- rithm estimates simultaneously plant parameters and Kalman gain   K   s for state estimation. Therefore, to achieve parameter convergence,   the   plant   input   signal   I   can   be   persistently exciting of a lower order in our approach compared to   a Bootstrap Algorithm. Secondly, since (7) can be written as a linear regression, it is suitable for an RLS-type parameter estimator. For a Bootstrap Algorithm   an   parameter estimator based on pseudo   linear regression   would   be   needed,   e.g.   Extended Least   Squares (ELS).   The convergence properties of these estimators are more restrictive compared to an RLS algorithm. Thirdly   we   filter   RLS   inputs   Uk   and   'Pk,   as   suggested in [9], to suppress noise and to use only informative data for   parameter   estimation.   In   our   approach,   the   parameter estimator is independent from state estimation, therefore the filter is not part of the closed control loop. Due to combined state and parameter estimation the Bootstrap Algorithm in contrary would be part of the control loop. Therefore the filter becomes part of the control loop, too, and filter dynamics may deteriorate closed loop dynamics. Defining the tracking error (   'P(Z)) 'Pref(z)   -   'P(z)   =   1 -   ()   'Pref(z)   =   e(z)'Pref(Z)  'Pre! Z   (43) and calculating the steady state error using the final value theorem according to [5] we get  v.   CONTROLLER Using state estimates from (33) and disturbance feed for- ward (24) together with reference input   r,   we are able to formulate the following control law:  k   A   k:\"   Tdk Uk   rk   -   Ik   'Pk   -   2k 'Pk   +   km  +:: sgn(<Pk)   + :: COS(<Pk)   (34)  With the control law (34) applied to plant (5) and using z- Transformation we derive a second order closed loop system with characteristic equation .   (   TZ).   (   Tz   ) hm   (z   -   l)e(z)   (   )2   =   hm   e(z)--  z~I   Z   -   1   z~I   Z   -   1  The nominator polynomial of   e(z)   is  (z-1)2+qIZ+q2  (44) (45) Feedback gain k i   and   k 2   are determined by comparison of co- efficients with the desired   2nd   order closed loop characteristic polynomial with closed loop natural frequency   Wo   and damping (. After replacing the plant parameters with their estimates we derive:  A   2   A   A  k i   =   Jwo/km,   k2   =   (2(woJ   -   d)/km   (37)  T q2   J( -d   -   kmk2   +   Tkmki   +   kmW2   -   TkmWI) T qi   J(d   +   kmk2   -   kmW2)   (46)  If WI and   W2   are as follows (47) with coefficients  d Wi   =   k i ,   W2   =   k2   +   k m qi   and   q2   equal zero, provided   d   approaches   d.   Then steady state tracking error (44) will also be zero and therefore ramp following without steady state tracking error is established. (36) (35) +  Z2   +   2((woT   -   l)z   +   (w5T2   -   2(woT   +   1) = 0 594 Authorized licensed use limited to: Morgan State University. Downloaded on January 17,2025 at 15:25:01 UTC from IEEE Xplore. Restrictions apply.\nand From equation (49) and state estimator (33) we get  Xk+l   (A k   -   EkKek   -   KSkC)Xk   +   Ekrk   +   KskYk Uk   -KekXk   +   rk   (50)  the estimated plant parameters. Rough approximations of the real inertias   (J2e   ~   0.002   kgm 2 , J4e   ~   0.006   kgm 2 )   indicate that the estimated inertias   j   converge towards realistic values. Estimated viscous   friction   coefficient   d   increases   with the number of the attached cameras. The estimated Couloumb friction   coefficient   f   e   seems   to   be   independent   from   the platform configuration.   f   u ,   resulting from unbalanced mass, changes its sign with the change from the 2c- to the 4c- configuration.   For   the   2c-configuration   pitch   axis   encoder is outweighing pitch axis drive, resulting in a negative   f   u  (Fig.l(b)). For the 4c-configuration the two cameras on the side of the pitch axis drive are equipped with larger lenses, Fig. 2.   Estimated plant parameters: The red line corresponds to the 4c-, the blue line to the 2c-configuration. Solid lines correspond to step responses and dash-dotted lines to position ramp tracking. stable, the stability proof can be extended to the practically important case that   u ( z)   saturates [13] . Note that convergence of the estimated parameters to the true plant parameters is not necessary for the proof. Plant parameters are considered time invariant since the controller is switched off during camera exchange. Further- more the plant is stable.   Ap(z)   and   Ep(z)   are bounded due to the properties of the RLS-algorithm (12) to (15) [7, Lemma 3.3.8]. The Kalman filter (33) is stable if   (A,   C)   is detectable [7]. Since   (A,   C)   is observable it is also detectable and thus (33) is stable which implies that   K s   is bounded.   Ap(z)   and  Ep(z)   are bounded, thus   j   and   d are bounded either. Therefore equation (37) results in bounded   K   e such that the desired closed loop characteristic equation (36) is satisfied. It follows that all coefficients in (51) and (52) are bounded, which again implies that   L(z), P(z)   and   M(z)   are bounded polynomials. Since the preconditions for the stability proofs in [7] and [13] are met, we can conclude that the presented controller is stable in the above sense (56). VII.   EXPERIMENTAL RESULTS To test the validity of our approach, we conducted several experiments with two changing configurations of the camera platform.   We   used   the   configurations   shown   in   Figure   1 with two and four cameras called 2c- and 4c-configuration, respectively. No pitch camera was used for this test. To test both step responses and the tracking of a position ramp, we switched the reference   signal repeatedly between a square signal with amplitude 15° and 2s cycle time and a position ramp with slope 5° / s and   lOs   cycle time. Figure 2 depicts  !o:J ·····!····!·····!····!·····I   ,!o:J~····!····!······!····1 o   2   4   6   8   10   0   2   4   6   8   10  yO:::~······L···~········:.···~·····.·······   y :::~-,--~-----~-~'I 3;.0.01~   .=   :   ~   3;.   0   ·   ·:   ·   ·  <.:'   -----   -   (~   .  0.005   :   ;   :   :.......   -0.01   :   ;   :   :   .  .   .   .   .   .   .   .   . .   .   .   .   .   .   .   .  o   .   . ..   -0.02···· o   2   4   6   8   10   0   2   4   6   8   10  ~~   ~~  (49) (51) (53) (52)  y(z) r(z)  u(z)   det (ZI-A+!/£c+KsC -{[s)   F(z)  y(z)   det(zI   -   A   +   EKe   +   KsCd)   L(z)  Thus having controller polynomials   M(z),   P(z)   and   L(z)  as   well   as   state   space   model   (31)   and   (32)   rewritten   in polynomial form   Ap(z)y(z)   =   Bp(z)u(z),   the closed loop transfer function   y( z)   /   r( z)   can be written as After applying z-Transform to (50), we can derive the two transfer   functions   u(z)   /   r( z)   from   reference   input   r( z)   to controller output   u( z)   and   u( z)   /   Y( z)   from plant output   y(z)  to controller output   u(z).   As described in [12] we obtain  u(z)   det   (ZI-A+~~:+KsCd   -/J)   M(z)  r(z)   det(zI   -   A   +   EKe   +   KsCd)   L(z)  Since we used state space design techniques to derive the con- trollaw (50), the desired closed loop characteristic polynomial  A*(z)   is as follows  A*(z)   =   det(zI   -   A   +   EKe)   .   det(zI   -   A   +   KsC)   (54)  with desired closed loop poles   det(zI   -   A   +   EKe)   resulting from state feedback control law as defined in equation (49) and   det(zI   -   A   +   KsC)   as characteristic polynomial of the state estimator (33).   K e   is chosen such that equation (36) is satisfied and   K   s   is the Kalman gain derived from (33). As a result of the proof in [7, sec. 6.5] the closed loop characteristic polynomial of transfer function (53) tends to the desired closed loop characteristic polynomial   A * (z):  Ap(z)L(z)   +   Bp(z)P(z)   -+   A*(z)   for   t   -+ 00   (55) The proof establishes: (i)   u(z), y(z)   bounded (ii)   lim   (z   -   1)   (A* (z)y(z)   -   Ep(z)M(z)r(z))   = 0 z~l  (56) for time invariant plant parameters if   Ap(z), Ep(z), L(z), P(z)   and   M(z)   are bounded. Furthermore, if the plant is VI.   STABILITY CONSIDERATIONS In this section we want to demonstrate that the stability proof given in [7] for an adaptive pole placement algorithm can be applied to our control law design. Note first, that using equation (24) and defining controller gain  K e   =   (k 1 ,   k2 ,   -k;;/,   O)T   (48)  control law (34) can be rewritten as 595 Authorized licensed use limited to: Morgan State University. Downloaded on January 17,2025 at 15:25:01 UTC from IEEE Xplore. Restrictions apply.\ncompared to the two cameras on the opposite side, leading to a positive sign of   f   u   (Fig. 1(b)). Since these are closed loop experiments, we cannot expect, that the estimated parameters approach the true values of the plant parameters. Moreover, the estimates depend on the kind of experiment conducted (step response or position ramp). However, the estimates converge to constant values. This indicates, that the stability considerations in section VI are valid and therefore our control objectives can be achieved without parameter convergence. In Figure 3(a) the step responses for the two configurations are shown. The step response of the 4c-configuration is slower compared to   the   2c-configuration.   This   is   due   to   higher inertia and the corresponding adjustment of closed loop dynamics. The tracking of a position ramp   seems   not   to   be   affected   by the two different platform configurations (Fig. 3(b)). Figure 3(c) depicts the effects of disturbance feedforward (24) while tracking   a position ramp (2c-configuration only).   It shows the   plant reference   torque   kmI   over position   <p   in black. This is a measure for the real disturbance torque, since in the undisturbed case at constant velocity   kmI   equals zero. The disturbance torque comprises Coulomb friction torque, offset torque resulting from unbalanced mass and torque ripple REFERENCES [1]   E. D. Dickmanns, \"An advanced vision system for ground vehicles,\" in  Proceedings of the 1st International Workshop on 'In-Vehicle Cognitive Computer Vision Systems',   Graz, Austria, April 2003. [2] --,   Dynamic Vision for Perception and Control of Motion.   London: Springer, 2007. [3]   K.   KUhnlenz,   M.   Bachmayr,   and   M.   Buss,   \"A   Multi-Focal   High- Performance Vision System,\"   Proceedings of the 2006 IEEE Interna- tional Conference on Robotics and Automation,   pp. 150-155, 2006. [4]   K. KUhnlenz, \"Aspects of Multi-Focal Vision,\" Dissertation, Technische Universitat MUnchen, MUnchen, 2006. [5]   J. Schiehlen, \"Kameraplattformen fUr aktiv sehende Fahrzeuge,\" Disser- tation, Universitat der Bundeswehr MUnchen, 1995. [6]   C. Canudas, K. J. Astrom, and K. Braun, \"Adaptive Friction Compen- sation in DC-Motor Drives,\"   IEEE Journal of Robotics and Automation,  vol. RA-3, No.6, pp. 681-685, 1987. [7]   G. C. Goodwin and K. S. Sin,   Adaptive Filtering Prediction And Control,  ser. Information and System Sciences, T. Kailath, Ed.   Engelwood Cliffs, New Jersey 07632: Prentice-Hall, Inc, 1984. [8]   A.   Ramasubramanian and L.   R.   Ray,   \"Comparison of EKBF-based and Classical Friction Compensation,\"   Journal of Dynamic Systems, Measurement, and Control,   vol. 129, pp. 236-242, 2007. [9]   K. J. Astrom and B. Wittenmark,   Adaptive Control,   ser. Control Engi- neering.   New York: Addison-Wesley Publishing Company, 1989. [10]   A. Gambier and Y. Y. Nazaruddin, \"Multivariable State-space Adaptive Control,\"   Automatisierungstechnik,   vol. 11/53, pp. 537-545, 11 2005. [11]   M.   S. Ahmed and N.   Sait, \"State-space adaptive control through a modified bootstrap algorithm for parameter and state estimation,\" in  IEEE Proceedings,   vol. 136, no. 5, 1989, pp. 215-224. [12]   G. F. Franklin, J. D. Powell, and A. Emami-Naeini,   Feedback Control of Dynamic Systems,   4th ed.   Upper Saddle River, New Jersey: Prentice Hall, 2002. [13]   D. Y. Abramovitch and G. F. Franklin, \"On the Stability of Adaptive Pole Placement Controllers with a Saturating Actuator,\"   IEEE Transactions on Automatic Control,   vol. 35, no. 3, pp. 303-306, March 1990. that   orIgInates   from   the   drive   bearings.   The   hysteresis of ±O.OIN m   between the two black lines is a measure for the friction torque. Without unbalanced mass disturbance torque would be symmetric to the zero torque line. Therefore the displacement of -O.OIN m   is a measure for the disturbance torque resulting from unbalanced mass. Estimated disturbance torque fd is shown in green. The estimated offset torque is approximately half of the size of the real offset torque. The estimated friction   torque   is   nearly   zero   and the estimated torque   ripple   corresponds   to   the   real   torque   ripple.   This indicates, that the disturbance feedforward (24) compensates effectively for friction   (T c )   and offset torque   (T u ).  VIII.   CONCLUSION In this paper a multi focal camera platform is presented together with its motion controller. The platform is designed for easy exchange of the cameras while preserving extrinsic camera parameters for later reuse of a platform configuration. The possibility of altering platform configurations implies the need for an adaptive motion controller. The adaptive state space control   algorithm   proposed in   this   paper meets   the control objectives of fast saccades and tracking of a position ramp. Moreover it was shown that the control algorithm is stable. But noting that the step responses in figure 3(a) are not perfectly   symmetric,   there   might be the possibility   to further speed up the step responses by means of an improved controller. The investigation of the achievable repeat accuracy concerning the extrinsic camera parameters   is   also left to future research.  10  10   II  --IPre!  0.25   0.3  ...... ~··IPre!··  ,--IP4c, --IP2c  0.2 6 Time[s] 0.1   0.15 Time[s] (a) Step response (b) Tracking a position ramp 0.05 (c) Disturbance rejection (2c-configuration) Fig. 3.   Control performance  -IO~·······.········~:·······:········.··'····\",,,:/  -15 15 10  ~  9- -5 -10 -15 0.01 0.005 -0.005 8'   -0.01 ~  -0.015 -0.02 -0.025 -0.03   -15 -20 596 Authorized licensed use limited to: Morgan State University. Downloaded on January 17,2025 at 15:25:01 UTC from IEEE Xplore. Restrictions apply."
  },
  {
    "document_number": 3,
    "text": "Autonomous Cornering Control based on Sense of Circular Vision Model Ren Degoshi, Hiroyuki Masuta, Youtaro Fuse, Tatsuo Motoyoshi, Kei Sawai, Myagmardulam Bilguunmaa, Noboru Takagi  Dept. of Intelligent Robotics Toyama Prefectural University  Toyama, Japan u354014@st.pu-toyama.ac.jp, {masuta, fuse, motoyosh, k_381, bilguunmaa, takagi}@pu-toyama.ac.jp  Abstract —Recently,   Research   and   Development   of technology are actively conducted in the automotive industry. When automated driving becomes widespread, it is important to have a vehicle control system that does not cause anxiety or discomfort to passengers. However, many people have concerns about comfort and safety of autonomous driving system. One factor is the difference between automated driving and human driving. In advanced driver assist system, autonomous driving controller is considered human perception based on “human” system design. However, autonomous cornering control doesn’t consider   human   perception   factors.   In   previous   research, Kumano et al. defined the Sense of Circular Vision ( SoCV ) as a type of sensory information expressed by the visual stimulation of optical flow on the retina during cornering behavior. In this paper, we focus on the vehicle control based on the   SoCV   model. And we discuss what kind of driving characteristics according to the optical flow based visual feedback.  Keywords—   Autonomous-Vehicle,   Anxiety,   Optical Flow, Human Visual Information, Discomfort Perception  I.   INTRODUCTION  A.   Background  Recently,   development   and   research   of   autonomous driving technology are actively conducted in the automotive industry. Autonomous driving technology is expected to drastically decrease traf   fic   accidents   and   support transportation for elderly individuals. However, many people have concerns about comfort and safety of autonomous driving system [1]. Matuura etc., insists that one of the reasons is the difference between the   driving style of autonomous driving   behavior   and   human   driving   behavior   [2].   An autonomous vehicle often focuses on the “automobile and environment” system, however “human system” which is considered a human being is important [3]. In advanced driver assist system, autonomous driving controller is considered human perception based on “human” system design. For example, an   adaptive cruise control is controlled following distance based on the human perceived sense of approach model [4].   As a result, the discomfort of passenger is reduced. On the other hand, current autonomous cornering control like Lane K   eep Assist System keeps a vehicle within the center of th e lane according to GPS and map information.   This   autonomous   cornering   control   doesn’t consider human perception factors. Generally, a driver uses various sensory organs to operate a vehicle based on the surrounding environmental information and vehicle behavior [5]. Especially, visual information is the most important. In the cornering control, a human mostly relies on the visual perception. This research is focused on the visual   perception.   This   research   is   focus   on   the   visual perception like human being in the cornering behavior.  B.   Related Reserch  There is a lot of research related to visual information and driving. Optical Flow (OF) is the flow of light projected onto the human retina as defined by Gibson [6]. Drivers perceive future trajectory from OF[3][7][8]. Ino et al. insists that optical flow based autonomous driving is controlled similarly to the human expert driver [3]. Fig. 1 shows a conceptual image of the OF as perceived by the driver. The OF that is caused by the vehicle motion expands from the center of the front vision when a vehicle is approaching a corner.   On the other hand, the flow due to eye movement is followed sideway. As a result, the OF on the retina expand from the corner ahead. This focus of expansion (FOE) corresponds to the expected position for arrival. Ino et al. insisted that a driver perceives the direction of their self-motion through the perception of this FOE [3]. Based on the above, the ideal trajectory was determined to ensure that the FOE is always aligned with the road.   As a result, the FOE based controller showed the turning radius, showing that there is a wide range in the selection of the target point. Moreover, the trajectory created by the FOE based controller was similar to that driven by an expert driver [9]. However, Ino’s approach is difficult to adapt to environmental changes, because determining th e target trajectory relies on GPS and map information. To adapt to environmental changes, Fig. 1.   Conceptual diagram of OF.  Flow due to vehicle motion viewpoint Flow by shifting viepoints Focus of Expansion  2024 IEEE International Conference on Fuzzy Systems (FUZZ-IEEE) | 979-8-3503-1954-5/24/$31.00 ©2024 IEEE | DOI: 10.1109/FUZZ-IEEE60900.2024.10611756  Authorized licensed use limited to: Morgan State University. Downloaded on January 16,2025 at 17:04:07 UTC from IEEE Xplore. Restrictions apply.\nfeedback control elements using camera images or other methods   would   be   required.   Therefore,   we   propose an autonomous cornering control including feedback elements that is calculated FOE using a camera image. In previous research, Kumano et al. defined the Sense of Circular Vision ( SoCV ) as a type of sensory information expressed by the visual   stimulation   of   optical   flow   on   the   retina   during cornering behavior [10][11]. We expect that ideal cornering control, which maintains a constant optical flow will be realized through feedback based on the output of the   SoCV  model.   Therefore, the ideal   cornering   control aims to constantly maintain the   SoCV . In this paper, we do not consider the implementation of the proposed method. Through simulation experiments, we evaluate the outcomes resulting from the application of this control. II.   SENSATION OF CIRCULAR VISION MODEL  A.   The methods of Calculating OF  This section explains the   SoCV   as proposed by Kumano et al. The   SoCV   represents the detection of optical flow and FOE from   the   perspective projected   onto   the   retina   [10][11]. Section   A   describes   how   OF   is   calculated.   To   acquire information closely resembling the flow of light projected onto the human retina, we calculate OF through sensor and camera sensor fusion [10]. The extracted OF takes into account the lane boundaries, which are factors influencing human turning behavior, and computes the OF in the lane sections. The OF of the lane boundary projected on the retina is determined by the flow due to self-motion and the amount of   viewpoint   movement.   The   OF   due   to   self-motion   is calculated from the motion of the own vehicle to prevent noise. Equation (1) and (2) are calculated azimuthal direction   𝐹୅୸୧ሺ𝑡ሻ  and elevation direction   𝐹ୣ୪ୣ   ሺ𝑡ሻ of the OF.  𝐹୅୸୧ሺ𝑡ሻ ൌ 𝜃ᇱሺ𝑡ሻ െ 𝜃ሺ𝑡 െ   1 ሻ ∆𝑡   ሺ 1 ሻ  𝐹୉୪ୣ ሺ𝑡ሻ ൌ 𝜑ᇱሺ𝑡ሻ െ 𝜑ሺ𝑡 െ   1 ሻ ∆𝑡   ሺ 2 ሻ  𝜃 [rad] is the azimuth angle in retinal coordinates.   𝜑 [rad] is the elevation angle in retinal coordinates. The flow due to the viewpoint shift is half of the yaw rate of the vehicle. The OF projected   on   the   retina   is   obtained   by   subtracting   the viewpoint movement flow from the OF due to self-motion (Fig. 1). From insights in related studies, a group of FOE candidate points that radiate from the center of the viewpoint is considered the self-motion direction perception by the driver. The Optical Flow (OF)   around the FOE candidate points is oriented to the left when on the left side and to the right when on the right side [3].  B.   Sensation of circular vision model  The   previous   study   [3]   is   shown   that   the   driver's perception of self-motion is related to the FOE that radiates from the center of the viewpoint. Thus, the ideally obtained OF on the white line should be bilaterally symmetric. The visual deviation from this ideal state is defined as the Sense of Circular Vision ( SoCV ). On the other hand, it is difficult to evaluate the acquired OF equally on the left and right sides, because the directions, magnitudes and densities of the OFs are different. The number of OFs on the outside white line is greater than on the inside, and the flows on the near side have a larger magnitude than those on the far side in a curve. To evaluate OFs uniformly, a spiking neural network (SNN) is applied to be considered as a simulation on the retina. The spike response model is applied for the SNN to evaluate OFs [12]. Fig. 2 shows an overview of the neurons used in SNN. A flow neuron is placed on the lane boundary at every 0.035 [rad] step for elevation angles ranging from 0 ~ - 0.52 [rad]. The number of flow neurons at the left and right lane boundaries are   𝑁୐   and   𝑁ୖ   . Moreover, speed neurons and yaw rate neurons are placed to input the vehicle speed   V   [m/s] and the yaw rate   γ   [rad/s], respectively. Equation (3) shows the environmental inputs to the flow neuron   ℎ௜ ௘௫௧ , ிே . It takes as input the azimuthal direction of the lane boundary OF   𝐹୅୸୧ , ௜ [rad/s].  ℎ௜ ௘௫௧ , ிேሺ t ሻ ൌ 𝑘 ∙ 𝐹୅୸୧ , ௜   ሺ 3 ሻ  k is an arbitrary constant. In flow neurons, inputs are given so that the firing frequency of the neuron increases when flow occurs in the ideal direction.   The speed and yaw rate are normalized using a Gaussian membership function, and then inputted into each neuron. The SNN connects to all neurons and learns based on the Hebb rule, which is expected to reduce noise effectively and predict   changes   in   flow.   However,   the   learned   weight parameters are updated for each driving situation, therefore they cannot adapt to various situations. To adapt to various situations, multi-layered Neural Network (MNN) are used to maintain the learning weight parameters of the SNN for each situation. Fig. 3 shows the relationship between SNN and MNN. The inputs of MNN are curvature rate, vehicle speed and yaw rate, and the outputs are all weight parameters of SNN. The training, validation, and test data sets for training were obtained by randomly setting the vehicle speed, curve Fig. 2.   overview of SNN and MNN.  Fig. 3.   overview of the neurons used in SNN.  Authorized licensed use limited to: Morgan State University. Downloaded on January 16,2025 at 17:04:07 UTC from IEEE Xplore. Restrictions apply.\ncurvature radius, and turn radius and turning radius for a simulation of driving from straight ahead to the end of the road in a curve. The vehicle speeds ranged from 9 to 21 [km/h], and the turning radius ranged from 10 to 50 [m]. The MNN learns SNN   weights.   The   MNN   overwrite   the   SNN   weights corresponding to the facing situation. Finally, the evaluation value   of each lane boundary is calculated. The   SoCV   is defined as the difference in each evaluation value like Equation (4).  𝑆𝑜𝐶𝑉 ൌ   ∑   𝑝௜ , ௅ ா௉ௌ௉ ேై ௜ୀଵ 𝑁௅   െ   ∑   𝑝௜ , ோ ா௉ௌ௉ ே౎ ௜ୀଵ 𝑁ோ   ሺ 4 ሻ  𝑁௅   and   𝑁ோ   are the number of neurons on the left and right while lines,   𝑝௜ , ௅ ா௉ௌ௉   and   𝑝௜ , ோ ா௉ௌ௉   are the output of the   i -th neuron at each lane boundary. The   SoCV   is close to 0 when the flows on the left and right are equally expanded in the view. On the other, the   SoCV   has positive or negative value when the flows on the left and right are unequally expanded. This means that the FOE is placed the outside of the road area. III.   VEHICLE CONTROL MODEL In this chapter, we propose the cornering control system based on the   SoCV   model. Fig. 4 shows the conceptual diagram of the cornering control system. The meaning of symbols in Fig. 4 are shown in Table. 1.  A.   The conceptual diagram of the cornering system  In Fig.4, there are three   major units: the autonomous cornering control unit, the vehicle control unit, and the vehicle model unit. The vehicle model unit calculates the vehicle’s condition based on the input of the target torque on the drive shaft and the target steering angle using a 2-axle vehicle model in MATLAB/Simulink [13]. The vehicle control unit is a PI feedback controller for speed control, which outputs the target torque from the target speed,   and for steering angle control, which outputs the target steering angle from the target yaw rate. The autonomous cornering control unit outputs the target speed and the target yaw rate using fuzzy control and Model Predictive Control (MPC), respectively.  B.   Model Predictive Control in the Autonomous cornering control unit  This section explains that the target yaw controller using a model predictive control to decide the target trajectory. The objective of this controller is to find the target yaw rate that achieves the minimum   SoCV   value. Fig. 5 shows a processing procedure to find the target yaw rate value. To achieve the minimum   SoCV   along the target trajectory, it is necessary to consider the future changes in   SoCV , focusing not only on the current state but also on the anticipated future state. Model Predictive Control (MPC) is a control method that predicts the future behavior of a control target based on observations and models, and then finds the optimum control input under a given evaluation function [14]. MPC (Model Predictive Control) can integrate and optimize both feed- forward and feedback control, making it well-suited for representing human behavior.   Similarly,   a   human   driver determines the operation by considering the future state, while also observing the current situation and the behavior of the vehicle[14]. The inputs are the lane boundary information from the environment, and the vehicle condition of the vehicle position, yaw angle, speed and yaw rate.   Using these input data, a total   SoCV   for a trajectory is calculated based on a candidate yaw rate and at a constant speed. The total   SoCV   of a trajectory is the evaluation function   J   is shown in equation (4).  𝐽௜ ൌ ∑   𝑆𝑜𝐶𝑉ሺ𝑡ሻଶ ௧௣ ௧ୀ଴   (4) where   𝑡௣ is the prediction execution time.   i   represents the  i -th number in the series of target yaw rate candidates. The execution time denoted as   t   is measured from the current position to   𝑡௣   in increments of 0.1 seconds.  The target yaw rate candidates denote as   𝛾୧   are defined as  values ranging from   േ   0.3 [rad/s] relative to the current yaw rate   𝜃ሶ , in increments of 0.01 [rad]. Finally, the target yaw rate is chosen from the yaw rate candidate that has the minimum  Ji , as described in Equation (5). Fig. 4 the overall diagram of the control model. Target Yaw rate Controller  （ MPC ）  Target Velocity Controller (Fuzzy) Lane boundary Vehicle Condition  ( x , y , V ,   )  Speed Control Steering angle control Vehicle Control Unit Vehicle model Target Operating Volume Determination Unit TABLE I.   VEHICLE PARAMETERS  Vehicle Position [m] Vehicle Speed [m/s] Target Speed [m/s] Vehicle Yaw rate [rad/s] Target Yaw rate [rad/s] Steer Angle [rad] Torque [N ・ｍ ]  Fig. 5 the overall diagram of the control model. Start End Yaw rate search Calculate SoCV at each yaw rate Calculate J at each yaw rate Outputs the target yaw rate at which J is minimised Outputs target speed by fuzzy control with Jmin input Yaw rate search end  Authorized licensed use limited to: Morgan State University. Downloaded on January 16,2025 at 17:04:07 UTC from IEEE Xplore. Restrictions apply.\n𝛾୘ ൌ   argmin ሺ𝐽௜ሻ   (5)  C.   Fuzzy Control in the Autonomous cornering control unit  This section describes the longitudinal motion control method for vehicles. As shown in Fig. 4, longitudinal motion control is performed by calculating the target speed using fuzzy control. Therefore, we considered that fuzzy control can be used for longitudinal motion control to smooth out changes in velocity. The output for determining the target speed is calculated based on the MPC evaluation function J in order to consider the dynamics of the turning sensory model output value   SoCV . To determine the optimal value including the entire prediction interval, the minimum term of the target speed is determined using   𝐽௠௜௡   as input. Fig. 6 shows the membership function for fuzzy inference. Fig. 6 (a) shows the membership function for the input   𝐽୫୧୬ . Fig. 6 (b) shows the output. The minimax center-of-gravity method is used to determine the numerical values. Fuzzy outputs   𝜇   are output as 0~1. The target yaw rate is calculated by the output   𝜇 . IV.   EXPERIMENT BY SIMULATION  This chapter presents the e xperimental results. Section A provides   an   overview   of   the   simulation.   Subsequently, Sections B and C describe the simulation results and the discussion, respectively. We assume a single apex corner as shown in Fig. 7 for our simulation.  A.   Simulation overview  Fig. 7 shows the driving course used in the simulation. This course is composed of straight sections and corners with an apex radius of 40 meters. The road width is 3.5 meters. However, a relaxation curve is not set at the junctions between the straight sections and curves. The simulation environment was   created   using   the   MATLAB/Simulink   Automated Driving Toolbox. The Automated Driving Toolbox provides algorithms and tools for designing, simulating and testing ADAS and automated driving systems[15]. This simulation performs three cases, the first with the vehicle speed constantly at 30 km/h without speed control (Case 1), the second with the vehicle speed constantly at 60 km/h without speed control (Case 2), and the third with an  The   purpose   of   this   simulation   is   to   consider   visual information from the verification of driving characteristics of a vehicle control system using the Sense of Circular Vision model   SoCV . This simulation is performed by simulating running at a velocity of 30 [km/h], constantly running at a velocity of 60 [km/h], and finally running at an initial velocity of 60 [km/h], with velocity control. The predicted interval   𝑡௣   was set to 1.5 seconds. Through the simulation, we verify the characteristics of the vehicle's motion based on the   SoCV . Our proposed method considers only the visualization of the front vision flows, not the road layout. Therefore, we focus on the running trajectory and the condition of the vehicle.  B.   Simulation results  Fig. 8, Fig. 9, and Fig. 10 show the simulation results for Case 1, Case 2, and Case 3, respectively. In Fig. 8 and 9, (a) to (e) illustrate the acquired trajectory, measured X-Y position, acceleration, yaw rate, and   SoCV , respectively. In Fig. 10, (a) to (f) illustrate the acquired trajectory, measured X-Y position, velocity, acceleration, yaw rate, and   SoCV , respectively. In Fig. 8,   the vehicle begins to turn the steering wheel at 6 seconds from the start, just before the corner. Subsequently, the   SoCV   increases from t=6 [s] to t=8.5 [s], reaching a maximum value of 0.04. Afte rwards, both acceleration and yaw rate increase, but the   SoCV   approaches 0. The trajectory shows that the vehicle moves closer to the inner side of the corner, similar to human driving behavior. In Fig. 9, the vehicle deviates from the course at t = 4.5 [s]. Generally, it is not safe for a vehicle to run at R = 40 [m] and V = 60 [km/h]. The vehicle deviates from the road at t = 4.5 [s], leading to a considerable increase in the   SoCV . This implies   that   a   human   would   experience   strong   visual stimulation upon deviating from the road, corresponding to the   SoCV   of about 0.1. Yaw rate and lateral acceleration are significantly increased. This means that the vehicle is trying to turn the corner to match the curvature, however the vehicle cannot turn properly due to excessive speed. In Fig. 10,   the vehicle completes a course even if the speed is 60 [km/h]. In Fig. 10, the vehicle completes a course even at a speed of 60 km/h. Fi g. 10(c) shows that the speed decreases 2 seconds before thecorner, and then increases from 8.4 [s] until the end of the corner due to the action of the speed Fig. 7 the curse of simulation.  X  ሾ m ሿ  60[m] R=40[m] S(0,0) Clipping Point  Y   ሾ m ሿ  30[m] G(100,70)  Fig. 6(b) the overall diagram of the control model. Fig.6 the Functionship  0   0.1   0.2   0.3   0.4   0.5   0.6   0.7   0.8   0.9   1 output1 0 0.2 0.4 0.6 0.8 1   Low_output   normal_output   High_output  Fig. 6(a) the overall diagram of the control model.  0   0.05   0.1   0.15 input1 0 0.2 0.4 0.6 0.8 1   small   normal   large  Authorized licensed use limited to: Morgan State University. Downloaded on January 16,2025 at 17:04:07 UTC from IEEE Xplore. Restrictions apply.\nFig. 8 results of simulation (Case 1)  0   2   4   6   8   10   12   14   16 Time[sec] -0.1 0 0.1  (a) Path (b) Position (c) Acceleration (d) Yaw rate (e) SoCV t = 6 [s]   t = 8.5 [s] t = 6 [s] t = 8.5 [s] Fig. 9 results of simulation (Case 2)  (a) Path (b) Position (c) Acceleration (d) Yaw rate (e) SoCV t = 4.5 [s] t = 4.5[s]  Authorized licensed use limited to: Morgan State University. Downloaded on January 16,2025 at 17:04:07 UTC from IEEE Xplore. Restrictions apply.\ncontroller.   Simultaneously,   the   yaw   rate   increases   in synchronization with the speed change starting at 2 seconds, as shown in Fig. 10(d). The cornering control begins earlier than Case1 due to the higher speed. The   SoCV   has a maximum value 0.06 at t=5 [s]. The area of highest visual stimulation is the approaching zone in the corner.  C.   Discuss simulation result  In this section, the discussion performs the relationship between the   SoCV   and driving characteristics comparing with each case. In the driving trajectory of Fig. 8(a) and Fig. 10(a), both vehicle trajectory traveled with a relaxation curve before the corner. From the driving paths shown in Fig. 8(a) and Fig. 10(a), it was confirmed that the yaw rate changed before the corner. This indicates that the vehicle is traveling with a relaxation curve before the corner. The vehicle moves closer to the inside area at the approach of the corn er and then shifts towards the outside area at the end of the corner, depending on the vehicle speed. While on the corner, the flow on the outside is larger than on the inside. Therefore, the vehicle moves closer to the inside to achieve the   SoCV   closer to 0. In addition, the vehicle speed decreases before the corner and increases at the end of the corner. Since the   SoCV   cannot be reduced to below 0.1 with yaw rate control alone, the speed is decreased before the corner. These vehicle behavior characteristics are very close to those of human operation from related studies[3][9]. The SoCV model considers only the optical flow on the retina during cornering, without taking the road layout. Nevertheless, the vehicle takes a behavior similar to human driving. The behavior of a human driver may be more influenced by visual perception than by knowledge of the driving environment. In the experiment,   𝑡୮   is set to 1.5 [s]. This indicates that the vehicle considers a maximum distance of 25 [m] ahead in the case of Fig. 10. Consequently, anticipatory behavior is provided to achieve the minimum value of   SoCV . Ecological studies said that a human per ceives the approaching time to the target about 1.2 to 2.0 [s] before [15]. This feature contributes   to   the   similarity   with   the   \"smooth-running\" characteristic of human driving.Therefore, the prediction time range is important to similar the human driving. However, actual road conditions and other disturbances may also have an effect. We will discuss this prediction range in the future research. V.   CONCLUSION Many people have concerns about comfort and safety of autonomous driving system. One factor is the difference between automated driving and human driving. In advanced driver   assist   system,   autonomous   driving   controller   is considered human perception based on “human”   system design.   However,   autonomous   cornering   control   doesn’t consider human perception factors. In previous research, defined the Sense of Circular Vision (   SoCV ) as a type of sensory information expressed by the visual stimulation of optical flow on the retina during cornering behavior. In this paper, we focus on the vehicle control based on the   SoCV  model. And we discuss what kind of driving characteristics according to the optical flow   based visual feedback. As a result, the vehicle control by the   SoCV   approached human driving   characteristics.   Human   driver   behavior   may   be Fig. 10 results of simulation (Case 3)  0   2   4   6   8   10 Time[sec] 40 45 50 55 60  0   2   4   6   8   10 Time[sec] -5 0 5  Gx Gy  (b) Position (d) Acceleration (e) Yaw rate (f)   SoCV  t = 2[s]   t = 8.4[s]  (a) Path t = 2 [s] t = 8.4 [s] t = 5[s] t = 5 [s] (c) Velocity  Authorized licensed use limited to: Morgan State University. Downloaded on January 16,2025 at 17:04:07 UTC from IEEE Xplore. Restrictions apply.\ninfluenced more by visual perception than by knowledge of the driving environment. In the future, we will discuss the prediction range of the model prediction for use in real environments. Moreover, we will conduct simulations in a double apex corner that simulate a real environment. REFERENCES [1]   Liljamo, T., Liimatainen, H., Pöllänen, M., “Attitudes and concerns on automated   vehicles,”   Transportaition   Research   Part   F:   Traffic Psychology and Behaviour, vol. 59, pp. 24-44, 2018 [2]   Matuura,   T.,   Satou,   K.,   “Classification   and   countermeasures   for anxiety   in   driving based   on   clinical   psychology,”   Journal of Autonomous Vehicle Technology, Vol. 48, No. 4, pp. 141-146, 2017. [3]   Ino, H., Fukao, T., “Modeling of Driver Steering Operation Based on Optical   Flow   (Second   Report)”,   Transactions   of   Society of Automotive Engineers of Japan. 2014, Vol.45, No.4, p.711. [4]   Morita, K., Ono, T., Sekine, M., \"Does Time-To-Collision Determine Brake Operation Timing\" Proceedings of the 4th ITS Symposium, pp. 2-5, 2005. [5]   Kishida, H., Matsuzaki, N., Uenuma, K., “Study on Device Controlling Visual Information to Improve Driver's Performance”, Transactions of the JSME,2008, Vol.75, No.745, pp.2254-2263. [6]   Gibson, J.J ，” The perception of the visual world Hougtton Mifflin ”，  1950 [7]   Ino, H., Fukao, T., “Modeling of Driver Steering Operation Based on Optical   Flow   (Second   Report)”,   Transactions   of   Society of Automotive Engineers of Japan. 2014, Vol.45, No.4, p.711. [8]   Ino, H., Fukao, T., Totsuka, S., et al., “Development of Steering Control System Based on Optical   Flow Model”, Transactions of Society of Automotive Engineers of Japan. 2015, Vol.46, No.2, p.443. [9]   Takahashi, A., Akiyama, Y., Hiraga, N., Hasegawa, Y., Yamakado, M., \" Study of Steering Control Model Based on the Expert Driver's Behaviour\",   Transactions of Society of Automotive Engineers of Japan, Vol. 50,No.1,pp.102-108, 2019. [10]   Kumano, Y., Masuta, H., Motoyoshi, T., Sawai, K., Takagi, N., \"Proposal of Optical Flow Calculation Method Using Celestial Sphere Camera   during Vehicle Turning\"   ,Proceedings   of   the 36th Fuzzy SystemSymposium,2020. [11]   Degoshi, R., Masuta, H., Fuse, Y. Motoyoshi, T. Sawai, K., Takagi, N., “Development of Optimal Turning Control Using a Turn Sensation Model Based on Optical Flow for Autonomous Driving”, The 31st Intelligent Systems Symposium 2023, FAN2023, Fr-C2, 2023 [12]   Wolfgang, Maass, Christopher M. BISHOP: Pulsed neural networks, MITpress,2001. [13]   MathWorks,   “Modeling   of   Vehicle   Motion   Systems” https://jp.mathworks.com/help/ident/ug/modeling-a-vehicle- dynamics-system.html [14]   A. Koga, et   al.:   “Personalized   autonomous driving   using   model predictive control : parameter estimation of personalized cost function”, International Journal of automotive engineering (IJAE), Vol. 47, No. 6, pp. 1431-1437 , 2016 [15]   MathWorks,   “Get   Started   with   Automated   Driving   Toolbox”, https://mathworks.com/help/driving/getting-started-with-automated- driving-toolbox.html?lang=en (2024-4-30) [16]   M. Kondo, “Fundamental Relationship between Steering and Motion of Automobiles”, Transactions of Society of Automotive Engineers of Japan, No.5, pp. 40-43, 1958.  Authorized licensed use limited to: Morgan State University. Downloaded on January 16,2025 at 17:04:07 UTC from IEEE Xplore. Restrictions apply."
  }
]